prolog.org

#+TITLE: Apuntes Programación Lógica Funcional
#+AUTHOR: Eduardo Alcaraz
#+email: eduardo.ac@morelia.tecnm.mx  
#+LaTeX_HEADER: \usepackage[spanish]{inputenc}
#+SETUPFILE: /home/likcos/Materias/Prolog/theme-readtheorg-local.setup
#+EXPORT_FILE_NAME: index.html
#+OPTIONS: num:nil
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style>pre.src {background-color: #303030; color: #e5e5e5;}</style>

* Conceptos Fundamentales
** Diferentes Estilos de Programación 


*** Estilos de Programación 
  
(también llamados estándares de código o convención de código) es un
término que describe convenciones para escribir código fuente en
ciertos lenguajes de programación. El estilo de programación es
frecuentemente dependiente del lenguaje de programación que se haya
elegido para escribir. Por ejemplo el estilo del lenguaje de
Programación C variará con respecto al del lenguaje BASIC. [fn:1]

[fn:1] La salida del libro es tacataca


*** Características del Estilo

na pieza clave para un buen estilo es la elección apropiada de
ombres de variable. Variables pobremente nombradas dificultan la
ectura del código fuente y su comprensión.

omo ejemplo, considérese el siguiente extracto de pseudocódigo:

+BEGIN_SRC C
t a b c 
 a < 24 and b < 60 and c < 60
return true
se
return false
+END_SRC

ebido a la elección de nombres de variable, es difícil darse cuenta
e la función del código. Compárese ahora con la siguiente versión:


#+BEGIN_SRC C
et horas minutos segundos 
f horas < 24 and minutos < 60 and segundos < 60
 return true
lse
 return false
#+END_SRC

La intención el código es ahora más sencilla de discernir, "dado una
hora en 24 horas, se devolverá true si es válida y false si no".


*** Nombres de Variable Apropiadas.
Una piedra clave para un buen estilo es la elección apropiada de
nombres de variable. Variables pobremente nombradas dificultan la
lectura del código fuente y su comprensión.  y Como ejemplo,
considérese el siguiente extracto de pseudocódigo:

 #+BEGIN_SRC C
et a b c
f a < 24 and b < 60 and c < 60
 return true
lse
 return false
 #+END_SRC

Debido a la elección de nombres de variable, es difícil darse cuenta
de la función del código. Compárese ahora con la siguiente versión:

#+BEGIN_SRC C
get horas minutos segundos 
if horas < 24 and minutos < 60 and segundos < 60
  return true
else
  return false
#+END_SRC

La intención el código es ahora más sencilla de discernir, "dado una
hora en 24 horas, se devolverá true si es válida y false si no".

