index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-10 jue 09:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apuntes Programación Lógica Funcional</title>
<meta name="author" content="Eduardo Alcaraz" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Apuntes Programación Lógica Funcional</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge9cf1a8">Conceptos Fundamentales</a>
<ul>
<li><a href="#org789c0b3">Diferentes Estilos de Programación</a>
<ul>
<li><a href="#org46ec854">Estilos de Programación</a></li>
<li><a href="#org27f793c">Características del Estilo</a></li>
<li><a href="#org043bc84">Nombres de Variable Apropiadas.</a></li>
<li><a href="#org08f6dd4">Estilo de indentación</a></li>
<li><a href="#org23b0b13">Bucles y estructuras de control</a></li>
<li><a href="#org37d7389">Espaciado</a></li>
<li><a href="#org17e9ce5">Evaluación de expresiones</a></li>
</ul>
</li>
<li><a href="#orgbf9078e">Analizando diferentes estilos de Programación</a></li>
<li><a href="#org3af4bfc">Paradigma de Programación</a>
<ul>
<li><a href="#orgb74fbb2">Tipos más comunes de paradigmas de programación</a></li>
</ul>
</li>
<li><a href="#org8a95ff1">Evaluación de expresiones</a></li>
<li><a href="#orge43c090">Tipos de datos</a></li>
<li><a href="#org4271aad">Disciplina de tipos</a></li>
<li><a href="#org319dbf4">Funciones</a></li>
</ul>
</li>
<li><a href="#orgc1f5e4a">Programación Funcional</a></li>
<li><a href="#orge5d4a2b">Lisp</a>
<ul>
<li><a href="#org72f7a53">Historia</a></li>
<li><a href="#orgd39a0ec">Programación en Lisp</a></li>
<li><a href="#org6495722">Expresiones</a></li>
<li><a href="#org58721f0">Datos</a></li>
<li><a href="#org620af45">Evaluación</a></li>
<li><a href="#orgdb54eef">Funciones en Lisp</a></li>
<li><a href="#org8587f7c">Listas</a></li>
<li><a href="#org2b0d9b3">Cons</a></li>
<li><a href="#org70fbe69">Funciones CAR y CDR</a>
<ul>
<li><a href="#org174a44f">Ejercicios car cdr</a></li>
</ul>
</li>
<li><a href="#org274a1e8">Entradas y salidas</a>
<ul>
<li><a href="#orgdaaed08">Funciones de Entrada:</a></li>
</ul>
</li>
<li><a href="#org0eb783f">Condicionales en Lisp</a>
<ul>
<li><a href="#org4269ebb">Condicionales Básicas</a></li>
<li><a href="#org2751723">Condicionales Anidadas</a></li>
<li><a href="#orgf57badc">Condicionales Complejas</a></li>
<li><a href="#orgf6465bc">Referencias</a></li>
</ul>
</li>
<li><a href="#org4ad9867">Listas de Asociación en Lisp</a>
<ul>
<li><a href="#org484675a">1. Acceder a un valor <b>*</b></a></li>
<li><a href="#org7c8bb12">2. Agregar un nuevo par clave-valor <b>*</b></a></li>
<li><a href="#org553e290">3. Modificar un valor existente <b>*</b></a></li>
<li><a href="#org19de8ae">4. Eliminar un par clave-valor <b>*</b></a></li>
</ul>
</li>
<li><a href="#org7107b7d">Casi-Quoting en Lisp</a>
<ul>
<li><a href="#orgc32c51e">Introducción</a></li>
<li><a href="#orgdf1570b">1. Operador `quote`</a></li>
<li><a href="#orgd68aa28">2. Operador `backquote`</a></li>
<li><a href="#org20a4361">3. Evaluación con la coma (`,`)</a></li>
<li><a href="#orge618cf9">4. Expansión de listas con `,@`</a></li>
<li><a href="#orgfc43ad1">5. Combinación de `backquote`, `,` y `,@`</a></li>
<li><a href="#org0332790">6. Ejemplos adicionales</a></li>
<li><a href="#orga4da171">8. Ejemplo completo</a></li>
</ul>
</li>
<li><a href="#org7e7c77d">mapcar en Lisp</a>
<ul>
<li><a href="#org37f7110">Introducción</a></li>
<li><a href="#org80e7c63">Sintaxis básica de mapcar</a></li>
<li><a href="#org5928267">Ejemplos básicos</a></li>
<li><a href="#orgc1aa77f">Ejemplos</a></li>
</ul>
</li>
<li><a href="#org5a4c081">Manual de Comparaciones en Lisp</a>
<ul>
<li><a href="#orgf4fdcc6">1. <b>eq</b></a></li>
<li><a href="#orgeb851ce">2. <b>eql</b></a></li>
<li><a href="#org07db937">3. <b>equal</b></a></li>
<li><a href="#org939cb51">4. <b>equalp</b></a></li>
<li><a href="#orga2946d8">5. <b>=</b></a></li>
<li><a href="#org6633be7">6. <b>/=</b></a></li>
<li><a href="#org2491f99">7. <b>string=</b></a></li>
<li><a href="#org76bb757">8. <b>string-equal</b></a></li>
<li><a href="#org8fe663b">9. <b>char=</b> y <b>char-equal</b></a></li>
<li><a href="#org6217282">Resumen</a></li>
<li><a href="#org47631f6">Ejemplo completo</a></li>
</ul>
</li>
<li><a href="#org73ed263">Funciones lambda en Lisp</a>
<ul>
<li><a href="#org4489ebb">Introducción</a></li>
<li><a href="#org9624bfb">Definición básica de una función lambda</a></li>
<li><a href="#org4a1c0a1">Ejemplos de uso de lambdas</a></li>
<li><a href="#org288ecf2">Ámbito de las lambdas</a></li>
<li><a href="#orgef45def">Lambdas como valores de retorno</a></li>
<li><a href="#orga2524a6">Usos comunes de lambdas</a></li>
<li><a href="#org22df448">Ejemplos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge2b9ad4">Prolog</a>
<ul>
<li><a href="#orge7d30bc">Corte</a></li>
<li><a href="#orgaee389b">Usos del corte</a></li>
<li><a href="#org09de58b">Corte y fallo</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge9cf1a8" class="outline-2">
<h2 id="orge9cf1a8">Conceptos Fundamentales</h2>
<div class="outline-text-2" id="text-orge9cf1a8">
</div>
<div id="outline-container-org789c0b3" class="outline-3">
<h3 id="org789c0b3">Diferentes Estilos de Programación</h3>
<div class="outline-text-3" id="text-org789c0b3">
</div>
<div id="outline-container-org46ec854" class="outline-4">
<h4 id="org46ec854">Estilos de Programación</h4>
<div class="outline-text-4" id="text-org46ec854">
<p>
(también llamados estándares de código o convención de código) es un
término que describe convenciones para escribir código fuente en
ciertos lenguajes de programación. El estilo de programación es
frecuentemente dependiente del lenguaje de programación que se haya
elegido para escribir. Por ejemplo el estilo del lenguaje de
Programación C variará con respecto al del lenguaje BASIC. <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>
</div>
</div>


<div id="outline-container-org27f793c" class="outline-4">
<h4 id="org27f793c">Características del Estilo</h4>
<div class="outline-text-4" id="text-org27f793c">
<p>
na pieza clave para un buen estilo es la elección apropiada de
ombres de variable. Variables pobremente nombradas dificultan la
ectura del código fuente y su comprensión.
</p>

<p>
omo ejemplo, considérese el siguiente extracto de pseudocódigo:
</p>

<p>
+BEGIN<sub>SRC</sub> C
t a b c 
 a &lt; 24 and b &lt; 60 and c &lt; 60
return true
se
return false
+END<sub>SRC</sub>
</p>

<p>
ebido a la elección de nombres de variable, es difícil darse cuenta
e la función del código. Compárese ahora con la siguiente versión:
</p>


<div class="org-src-container">
<pre class="src src-C">et horas minutos segundos 
<span style="color: #ffc777;">f</span> <span style="color: #ff98a4;">horas</span> &lt; 24 and minutos &lt; 60 and segundos &lt; 60
 <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">true</span>
lse
 <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>
</pre>
</div>

<p>
La intención el código es ahora más sencilla de discernir, "dado una
hora en 24 horas, se devolverá true si es válida y false si no".
</p>
</div>
</div>


<div id="outline-container-org043bc84" class="outline-4">
<h4 id="org043bc84">Nombres de Variable Apropiadas.</h4>
<div class="outline-text-4" id="text-org043bc84">
<p>
Una piedra clave para un buen estilo es la elección apropiada de
nombres de variable. Variables pobremente nombradas dificultan la
lectura del código fuente y su comprensión.  y Como ejemplo,
considérese el siguiente extracto de pseudocódigo:
</p>

<div class="org-src-container">
<pre class="src src-C">et a b c
<span style="color: #ffc777;">f</span> <span style="color: #ff98a4;">a</span> &lt; 24 and b &lt; 60 and c &lt; 60
 <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">true</span>
lse
 <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>
</pre>
</div>

<p>
Debido a la elección de nombres de variable, es difícil darse cuenta
de la función del código. Compárese ahora con la siguiente versión:
</p>

<div class="org-src-container">
<pre class="src src-C">get horas <span style="color: #ffc777;">minutos</span> <span style="color: #ff98a4;">segundos</span> 
<span style="color: #c099ff;">if</span> horas &lt; 24 and minutos &lt; 60 and segundos &lt; 60
  <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">true</span>
<span style="color: #c099ff;">else</span>
  <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>
</pre>
</div>

<p>
La intención el código es ahora más sencilla de discernir, "dado una
hora en 24 horas, se devolverá true si es válida y false si no".
</p>
</div>
</div>
