prolog.org
*** Estilo de indentación

 Estilo de indentación, en lenguajes de programación que usan llaves
 para indentar o delimitar bloques lógicos de código, como por
 ejemplo C, es también un punto clave el buen estilo. Usando un
 estilo lógico y consistente hace el código de uno más
 legible. Compárese:


  #+BEGIN_SRC C
 if(horas < 24 && minutos < 60 && segundos < 60){
    return true;
 }else{
    return false;
 }
  #+END_SRC
  o bien:
  #+BEGIN_SRC C
 if(horas < 24 && minutos < 60 && segundos < 60)
 {
    return true;
 }
 else
 {
    return false;
 }
  #+END_SRC

 con algo como:

  #+BEGIN_SRC C

 if(horas<24&&minutos<60&&segundos<60){return true;}
 else{return false;}
  #+END_SRC

 Los primeros dos ejemplos son mucho más fáciles de leer porque están
 bien indentados, y los bloques lógicos de código se agrupan y se
 representan juntos de forma más clara.

 Valores booleanos en estructuras de decisión Algunos programadores
 piensan que las estructuras de decisión como las anteriores, donde el
 resultado de la decisión es meramente una computación de un valor
 booleano, son demasiado prolijos e incluso propensos al
 error. Prefieren hacer la decisión en la computación por sí mismo,
 como esto:

  #+BEGIN_SRC C
 return horas < 12 && minutos < 60 && segundos < 60;
  #+END_SRC

 La diferencia es, con frecuencia, puramente estilística y sintáctica,
 ya que los compiladores modernos producirán código objeto idéntico en
 las dos formas.

*** Bucles y estructuras de control

  El uso de estructuras de control lógicas para bucles también es parte
   de un buen estilo de programación. Ayuda a alguien que esté leyendo
   el código a entender la secuencia de ejecución (en programación
   imperativa). Por ejemplo, el siguiente pseudocódigo:
	#+BEGIN_SRC C

   cuenta = 0
   while cuenta < 5
     print cuenta * 2
     cuenta = cuenta + 1
   endwhile
	#+END_SRC

 El extracto anterior cumple con las dos recomendaciones de estilo
 anteriores, pero el siguiente uso de la construcción for hace el
 código mucho más fácil de leer:

 #+BEGIN_SRC C

 for cuenta = 0, cuenta < 5, cuenta=cuenta+1
   print cuenta * 2
 #+END_SRC

 En muchos lenguajes, el patrón frecuentemente usado "por cada elemento
 en un rango" puede ser acortado a:

 #+BEGIN_SRC C

 for cuenta = 0 to 5
   print cuenta * 2
 #+END_SRC

*** Espaciado

 Los lenguajes de formato libre ignoran frecuentemente los espacios
 en blanco. El buen uso del espaciado en la disposición del código
 de uno es, por tanto, considerado un buen estilo de programación.

 Compárese el siguiente extracto de código C:

  #+BEGIN_SRC C
 int cuenta; for(cuenta=0;cuenta<10;cuenta++)
{printf("%d",cuenta*cuenta+cuenta);}
  #+END_SRC
  con:
  #+BEGIN_SRC C
 int cuenta;
 for (cuenta = 0; cuenta < 10; cuenta++)
 {
    printf("%d", cuenta * cuenta + cuenta);
 }
  #+END_SRC

 En los lenguajes de programación de la familia C se recomienda también
 evitar el uso de caracteres tabulador en medio de una línea, ya que
 diferentes editores de textos muestran su anchura de forma diferente.

 El lenguaje de programación Python usa indentación para indicar
 estructuras de control, por tanto se requiere obligatoriamente una
 buena indentación. Haciendo esto, la necesidad de marcar con llaves ({
 y }) es eliminada, y la legibilidad es mejorada sin interferir con los
 estilos de codificación comunes.

 
 Con todo, esto lleva frecuentemente a problemas donde el código es
 copiado y pegado dentro de un programa Python, requiriendo un
 tedioso reformateado. Adicionalmente, el código Python se vuelve
 inusable cuando es publicado en un foro o página web que elimine el
 espacio en blanco.

*** Evaluación de expresiones
  
 En general, salvo que se relacionen con las mencionadas sentencias modificadoras del 
 flujo, las palabras-clave señalan al compilador aspectos complementarios que no
 alteran el orden de ejecución dentro de la propia sentencia. Este orden viene 
 determinado por cuatro condicionantes:

 1. Presencia de paréntesis que obligan a un orden de evaluación
	específico.
 2. Naturaleza de los operadores involucrados en la expresión
	(asociatividad).
 3. Orden en que están colocados (precedencia).
 4. Providencias (impredecibles) del compilador relativas a la
	optimización del código.



** Analizando diferentes estilos de Programación


** Paradigma de Programación 

 Un paradigma de programación es una propuesta tecnológica adoptada por
 una comunidad de programadores y desarrolladores cuyo núcleo central
 es incuestionable en cuanto que únicamente trata de resolver uno o
 varios problemas claramente delimitados; la resolución de estos
 problemas debe suponer consecuentemente un avance significativo en al
 menos un parámetro que afecte a la ingeniería de software.


*** Tipos más comunes de paradigmas de programación 

**** Programación imperativa o por procedimientos: 
	 Es el más usado en general, se basa en dar instrucciones al ordenador
	de como hacer las cosas en forma de algoritmos. La programación
	imperativa es la más usada y la más antigua, el ejemplo principal
	es el lenguaje de máquina. Ejemplos de lenguajes puros de este
	paradigma serían el C, BASIC o Pascal.

**** Programación orientada a objetos: 
   Está basada en el imperativo, pero encapsula elementos denominados
   objetos que incluyen tanto variables como funciones. Está
   representado por C++, C#, Java o Python entre otros, pero el más
   representativo sería el Smalltalk que está completamente orientado a
   objetos.


**** Programación dinámica: 
	está definida como el proceso de romper
   problemas en partes pequeñas para analizarlos y resolverlos de forma
   lo más cercana al óptimo, busca resolver problemas en O(n) sin usar
   por tanto métodos recursivos. Este paradigma está más basado en el
   modo de realizar los algoritmos, por lo que se puede usar con
   cualquier lenguaje imperativo.

