index.html

<div id="outline-container-org08f6dd4" class="outline-4">
<h4 id="org08f6dd4">Estilo de indentación</h4>
<div class="outline-text-4" id="text-org08f6dd4">
<p>
Estilo de indentación, en lenguajes de programación que usan llaves
para indentar o delimitar bloques lógicos de código, como por
ejemplo C, es también un punto clave el buen estilo. Usando un
estilo lógico y consistente hace el código de uno más
legible. Compárese:
</p>


<div class="org-src-container">
<pre class="src src-C"> <span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>horas &lt; 24 &amp;&amp; minutos &lt; 60 &amp;&amp; segundos &lt; 60<span style="color: #c099ff;">){</span>
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">true</span>;
 <span style="color: #c099ff;">}</span><span style="color: #c099ff;">else</span><span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>;
 <span style="color: #c099ff;">}</span>
</pre>
</div>
<p>
o bien:
</p>
<div class="org-src-container">
<pre class="src src-C"> <span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>horas &lt; 24 &amp;&amp; minutos &lt; 60 &amp;&amp; segundos &lt; 60<span style="color: #c099ff;">)</span>
 <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">true</span>;
 <span style="color: #c099ff;">}</span>
 <span style="color: #c099ff;">else</span>
 <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>;
 <span style="color: #c099ff;">}</span>
</pre>
</div>

<p>
con algo como:
</p>

<div class="org-src-container">
<pre class="src src-C">
 <span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>horas&lt;24&amp;&amp;minutos&lt;60&amp;&amp;segundos&lt;60<span style="color: #c099ff;">){</span><span style="color: #c099ff;">return</span> <span style="color: #ff995e;">true</span>;<span style="color: #c099ff;">}</span>
 <span style="color: #c099ff;">else</span><span style="color: #c099ff;">{</span><span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>;<span style="color: #c099ff;">}</span>
</pre>
</div>

<p>
Los primeros dos ejemplos son mucho más fáciles de leer porque están
bien indentados, y los bloques lógicos de código se agrupan y se
representan juntos de forma más clara.
</p>

<p>
Valores booleanos en estructuras de decisión Algunos programadores
piensan que las estructuras de decisión como las anteriores, donde el
resultado de la decisión es meramente una computación de un valor
booleano, son demasiado prolijos e incluso propensos al
error. Prefieren hacer la decisión en la computación por sí mismo,
como esto:
</p>

<div class="org-src-container">
<pre class="src src-C"> <span style="color: #c099ff;">return</span> horas &lt; 12 &amp;&amp; minutos &lt; 60 &amp;&amp; segundos &lt; 60;
</pre>
</div>

<p>
La diferencia es, con frecuencia, puramente estilística y sintáctica,
ya que los compiladores modernos producirán código objeto idéntico en
las dos formas.
</p>
</div>
</div>

<div id="outline-container-org23b0b13" class="outline-4">
<h4 id="org23b0b13">Bucles y estructuras de control</h4>
<div class="outline-text-4" id="text-org23b0b13">
<p>
El uso de estructuras de control lógicas para bucles también es parte
 de un buen estilo de programación. Ayuda a alguien que esté leyendo
 el código a entender la secuencia de ejecución (en programación
 imperativa). Por ejemplo, el siguiente pseudocódigo:
</p>
<div class="org-src-container">
<pre class="src src-C">
   cuenta = 0
   <span style="color: #c099ff;">while</span> cuenta &lt; 5
     print cuenta * 2
     cuenta = cuenta + 1
   endwhile
</pre>
</div>

<p>
El extracto anterior cumple con las dos recomendaciones de estilo
anteriores, pero el siguiente uso de la construcción for hace el
código mucho más fácil de leer:
</p>

<div class="org-src-container">
<pre class="src src-C">
 <span style="color: #c099ff;">for</span> cuenta = 0, cuenta &lt; 5, cuenta=cuenta+1
   print cuenta * 2
</pre>
</div>

<p>
En muchos lenguajes, el patrón frecuentemente usado "por cada elemento
en un rango" puede ser acortado a:
</p>

<div class="org-src-container">
<pre class="src src-C">
 <span style="color: #c099ff;">for</span> cuenta = 0 to 5
   print cuenta * 2
</pre>
</div>
</div>
</div>

<div id="outline-container-org37d7389" class="outline-4">
<h4 id="org37d7389">Espaciado</h4>
<div class="outline-text-4" id="text-org37d7389">
<p>
Los lenguajes de formato libre ignoran frecuentemente los espacios
en blanco. El buen uso del espaciado en la disposición del código
de uno es, por tanto, considerado un buen estilo de programación.
</p>

<p>
Compárese el siguiente extracto de código C:
</p>

<div class="org-src-container">
<pre class="src src-C"> <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">cuenta</span>; <span style="color: #c099ff;">for</span><span style="color: #c099ff;">(</span>cuenta=0;cuenta&lt;10;cuenta++<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">{</span>printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"%d"</span>,cuenta*cuenta+cuenta<span style="color: #ff995e;">)</span>;<span style="color: #c099ff;">}</span>
</pre>
</div>
<p>
con:
</p>
<div class="org-src-container">
<pre class="src src-C"> <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">cuenta</span>;
 <span style="color: #c099ff;">for</span> <span style="color: #c099ff;">(</span>cuenta = 0; cuenta &lt; 10; cuenta++<span style="color: #c099ff;">)</span>
 <span style="color: #c099ff;">{</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"%d"</span>, cuenta * cuenta + cuenta<span style="color: #ff995e;">)</span>;
 <span style="color: #c099ff;">}</span>
</pre>
</div>

<p>
En los lenguajes de programación de la familia C se recomienda también
evitar el uso de caracteres tabulador en medio de una línea, ya que
diferentes editores de textos muestran su anchura de forma diferente.
</p>

<p>
El lenguaje de programación Python usa indentación para indicar
estructuras de control, por tanto se requiere obligatoriamente una
buena indentación. Haciendo esto, la necesidad de marcar con llaves ({
y }) es eliminada, y la legibilidad es mejorada sin interferir con los
estilos de codificación comunes.
</p>


<p>
Con todo, esto lleva frecuentemente a problemas donde el código es
copiado y pegado dentro de un programa Python, requiriendo un
tedioso reformateado. Adicionalmente, el código Python se vuelve
inusable cuando es publicado en un foro o página web que elimine el
espacio en blanco.
</p>
</div>
</div>

<div id="outline-container-org17e9ce5" class="outline-4">
<h4 id="org17e9ce5">Evaluación de expresiones</h4>
<div class="outline-text-4" id="text-org17e9ce5">
<p>
En general, salvo que se relacionen con las mencionadas sentencias modificadoras del 
flujo, las palabras-clave señalan al compilador aspectos complementarios que no
alteran el orden de ejecución dentro de la propia sentencia. Este orden viene 
determinado por cuatro condicionantes:
</p>

<ol class="org-ol">
<li>Presencia de paréntesis que obligan a un orden de evaluación
específico.</li>
<li>Naturaleza de los operadores involucrados en la expresión
(asociatividad).</li>
<li>Orden en que están colocados (precedencia).</li>
<li>Providencias (impredecibles) del compilador relativas a la
optimización del código.</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-orgbf9078e" class="outline-3">
<h3 id="orgbf9078e">Analizando diferentes estilos de Programación</h3>
</div>


<div id="outline-container-org3af4bfc" class="outline-3">
<h3 id="org3af4bfc">Paradigma de Programación</h3>
<div class="outline-text-3" id="text-org3af4bfc">
<p>
Un paradigma de programación es una propuesta tecnológica adoptada por
una comunidad de programadores y desarrolladores cuyo núcleo central
es incuestionable en cuanto que únicamente trata de resolver uno o
varios problemas claramente delimitados; la resolución de estos
problemas debe suponer consecuentemente un avance significativo en al
menos un parámetro que afecte a la ingeniería de software.
</p>
</div>


<div id="outline-container-orgb74fbb2" class="outline-4">
<h4 id="orgb74fbb2">Tipos más comunes de paradigmas de programación</h4>
<div class="outline-text-4" id="text-orgb74fbb2">
</div>
<ul class="org-ul">
<li><a id="org22dbe1e"></a>Programación imperativa o por procedimientos:<br />
<div class="outline-text-5" id="text-org22dbe1e">
<p>
 Es el más usado en general, se basa en dar instrucciones al ordenador
de como hacer las cosas en forma de algoritmos. La programación
imperativa es la más usada y la más antigua, el ejemplo principal
es el lenguaje de máquina. Ejemplos de lenguajes puros de este
paradigma serían el C, BASIC o Pascal.
</p>
</div>
</li>

<li><a id="org5a9adb9"></a>Programación orientada a objetos:<br />
<div class="outline-text-5" id="text-org5a9adb9">
<p>
Está basada en el imperativo, pero encapsula elementos denominados
objetos que incluyen tanto variables como funciones. Está
representado por C++, C#, Java o Python entre otros, pero el más
representativo sería el Smalltalk que está completamente orientado a
objetos.
</p>
</div>
</li>


<li><a id="orgb5caacd"></a>Programación dinámica:<br />
<div class="outline-text-5" id="text-orgb5caacd">
<p>
 está definida como el proceso de romper
problemas en partes pequeñas para analizarlos y resolverlos de forma
lo más cercana al óptimo, busca resolver problemas en O(n) sin usar
por tanto métodos recursivos. Este paradigma está más basado en el
modo de realizar los algoritmos, por lo que se puede usar con
cualquier lenguaje imperativo.
</p>
</div>
</li>
