prolog.org
**** Programación dirigida por eventos: 
   la programación dirigida por
   eventos es un paradigma de programación en el que tanto la estructura
   como la ejecución de los programas van determinados por los sucesos
   que ocurran en el sistema, definidos por el usuario o que ellos
   mismos provoquen.


**** Programación declarativa:
	está basado en describir el problema
   declarando propiedades y reglas que deben cumplirse, en lugar de
   instrucciones. Hay lenguajes para la programación funcional, la
   programación lógica, o la combinación lógico-funcional. Unos de los
   primeros lenguajes funcionales fueron Lisp y Prolog.

**** Programación funcional:

 La programación funcional es un paradigma de programación declarativa
 basado en el uso de verdaderas funciones matemáticas. En este estilo
 de programación las funciones son ciudadanas de primera clase, porque
 sus expresiones pueden ser asignadas a variables como se haría con
 cualquier otro valor; además de que pueden crearse funciones de orden
 superior.​

 La programación funcional tiene sus raíces en el cálculo lambda, un
 sistema formal desarrollado en los años 1930 para investigar la
 naturaleza de las funciones, la naturaleza de la computabilidad y su
 relación con la recursión. Los lenguajes funcionales priorizan el uso
 de recursividad y aplicación de funciones de orden superior para
 resolver problemas que en otros lenguajes se resolverían mediante
 estructuras de control (por ejemplo, ciclos). Algunos lenguajes
 funcionales también buscan eliminar la mutabilidad o efectos
 secundarios; en contraste con la programación imperativa, que se basa
 en los cambios de estado mediante la mutación de variables. Esto
 significa que, en programación funcional pura, dos o más expresiones
 sintácticas idénticas (por ejemplo, dos llamadas a rutinas o dos
 evaluaciones) siempre devolverán el mismo resultado. Es decir, se
 tiene transparencia referencial. Lo anterior también puede ser
 aprovechado para diseñar estrategias de evaluación que eviten repetir
 el cómputo de expresiones antes vistas, ahorrando tiempo de ejecución.

 Los lenguajes de programación funcional, especialmente los puramente
 funcionales, han sido enfatizados en el ambiente académico y no tanto
 en el desarrollo comercial o industrial. Sin embargo, lenguajes de
 programación funcional como Lisp (Scheme, Common Lisp, etc.), Erlang,
 Rust, Objective Caml, Scala, F# y Haskell, han sido utilizados en
 aplicaciones comerciales e industriales por muchas
 organizaciones. También es utilizada en la industria a través de
 lenguajes de dominio específico como R (estadística), Mathematica
 (cómputo simbólico), J y K (análisis financiero). Los lenguajes de uso
 específico usados comúnmente como SQL y Lex/Yacc, utilizan algunos
 elementos de programación funcional, especialmente al procesar valores
 mutables. Las hojas de cálculo también pueden ser consideradas
 lenguajes de programación funcional.

**** Programación lógica:
   basado en la definición de relaciones lógicas,
	está representado por Prolog.


**** Programación con restricciones:
   similar a la lógica usando
	ecuaciones. Casi todos los lenguajes son variantes del Prolog.

**** Programación multiparadigma:
  es el uso de dos o más paradigmas dentro
	de un programa. El lenguaje Lisp se considera multiparadigma. Al
	igual que Python, que es orientado a objetos, reflexivo, imperativo y
	funcional.1
  
**** Lenguaje específico del dominio o DSL:
  se denomina así a los
	lenguajes desarrollados para resolver un problema específico,
	pudiendo entrar dentro de cualquier grupo anterior. El más
	representativo sería SQL para el manejo de las bases de datos, de
	tipo declarativo, pero los hay imperativos, como el Logo.

** Evaluación de expresiones

** Tipos de datos 

**  Disciplina de tipos

** Funciones


