index.html

<li><a id="org1341993"></a>Programación dirigida por eventos:<br />
<div class="outline-text-5" id="text-org1341993">
<p>
la programación dirigida por
eventos es un paradigma de programación en el que tanto la estructura
como la ejecución de los programas van determinados por los sucesos
que ocurran en el sistema, definidos por el usuario o que ellos
mismos provoquen.
</p>
</div>
</li>


<li><a id="org5d6aaba"></a>Programación declarativa:<br />
<div class="outline-text-5" id="text-org5d6aaba">
<p>
 está basado en describir el problema
declarando propiedades y reglas que deben cumplirse, en lugar de
instrucciones. Hay lenguajes para la programación funcional, la
programación lógica, o la combinación lógico-funcional. Unos de los
primeros lenguajes funcionales fueron Lisp y Prolog.
</p>
</div>
</li>

<li><a id="org14f79af"></a>Programación funcional:<br />
<div class="outline-text-5" id="text-org14f79af">
<p>
La programación funcional es un paradigma de programación declarativa
basado en el uso de verdaderas funciones matemáticas. En este estilo
de programación las funciones son ciudadanas de primera clase, porque
sus expresiones pueden ser asignadas a variables como se haría con
cualquier otro valor; además de que pueden crearse funciones de orden
superior.​
</p>

<p>
La programación funcional tiene sus raíces en el cálculo lambda, un
sistema formal desarrollado en los años 1930 para investigar la
naturaleza de las funciones, la naturaleza de la computabilidad y su
relación con la recursión. Los lenguajes funcionales priorizan el uso
de recursividad y aplicación de funciones de orden superior para
resolver problemas que en otros lenguajes se resolverían mediante
estructuras de control (por ejemplo, ciclos). Algunos lenguajes
funcionales también buscan eliminar la mutabilidad o efectos
secundarios; en contraste con la programación imperativa, que se basa
en los cambios de estado mediante la mutación de variables. Esto
significa que, en programación funcional pura, dos o más expresiones
sintácticas idénticas (por ejemplo, dos llamadas a rutinas o dos
evaluaciones) siempre devolverán el mismo resultado. Es decir, se
tiene transparencia referencial. Lo anterior también puede ser
aprovechado para diseñar estrategias de evaluación que eviten repetir
el cómputo de expresiones antes vistas, ahorrando tiempo de ejecución.
</p>

<p>
Los lenguajes de programación funcional, especialmente los puramente
funcionales, han sido enfatizados en el ambiente académico y no tanto
en el desarrollo comercial o industrial. Sin embargo, lenguajes de
programación funcional como Lisp (Scheme, Common Lisp, etc.), Erlang,
Rust, Objective Caml, Scala, F# y Haskell, han sido utilizados en
aplicaciones comerciales e industriales por muchas
organizaciones. También es utilizada en la industria a través de
lenguajes de dominio específico como R (estadística), Mathematica
(cómputo simbólico), J y K (análisis financiero). Los lenguajes de uso
específico usados comúnmente como SQL y Lex/Yacc, utilizan algunos
elementos de programación funcional, especialmente al procesar valores
mutables. Las hojas de cálculo también pueden ser consideradas
lenguajes de programación funcional.
</p>
</div>
</li>

<li><a id="org58cf98e"></a>Programación lógica:<br />
<div class="outline-text-5" id="text-org58cf98e">
<p>
basado en la definición de relaciones lógicas,
 está representado por Prolog.
</p>
</div>
</li>


<li><a id="org34067df"></a>Programación con restricciones:<br />
<div class="outline-text-5" id="text-org34067df">
<p>
similar a la lógica usando
 ecuaciones. Casi todos los lenguajes son variantes del Prolog.
</p>
</div>
</li>

<li><a id="orgd5d3cbb"></a>Programación multiparadigma:<br />
<div class="outline-text-5" id="text-orgd5d3cbb">
<p>
es el uso de dos o más paradigmas dentro
  de un programa. El lenguaje Lisp se considera multiparadigma. Al
  igual que Python, que es orientado a objetos, reflexivo, imperativo y
  funcional.1
</p>
</div>
</li>

<li><a id="org40dac1e"></a>Lenguaje específico del dominio o DSL:<br />
<div class="outline-text-5" id="text-org40dac1e">
<p>
se denomina así a los
  lenguajes desarrollados para resolver un problema específico,
  pudiendo entrar dentro de cualquier grupo anterior. El más
  representativo sería SQL para el manejo de las bases de datos, de
  tipo declarativo, pero los hay imperativos, como el Logo.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8a95ff1" class="outline-3">
<h3 id="org8a95ff1">Evaluación de expresiones</h3>
</div>

<div id="outline-container-orge43c090" class="outline-3">
<h3 id="orge43c090">Tipos de datos</h3>
</div>

<div id="outline-container-org4271aad" class="outline-3">
<h3 id="org4271aad">Disciplina de tipos</h3>
</div>
