index.html

<div id="outline-container-org319dbf4" class="outline-3">
<h3 id="org319dbf4">Funciones</h3>
</div>
</div>


<div id="outline-container-orgc1f5e4a" class="outline-2">
<h2 id="orgc1f5e4a">Programación Funcional</h2>
<div class="outline-text-2" id="text-orgc1f5e4a">
<p>
La programación funcional, o mejor dicho, los lenguajes de
programación funcionales, son aquellos lenguajes donde las variables
no tienen estado — no hay cambios en éstas a lo largo del tiempo — y
son inmutables — no pueden cambiarse los valores a lo largo de la
ejecución. Además los programas se estructuran componiendo expresiones
que se evalúan como funciones. Dentro de los lenguajes funcionales
tenemos Lisp, Scheme, Clojure, Haskell, OCaml y Standard ML, entre
otros.  Estos lenguajes están diversidad de tipificación, donde se
encuentran lenguajes dinámicos, estáticos y estáticos fuertes.
</p>


<p>
En los lenguajes funcionales las instrucciones cíclicas como for,
while y do-while no existen. Todo se procesa usando recursividad y
funciones de alto orden.
</p>

<p>
Esto se debe a los fundamentos matemáticos de la mayoría de los
lenguajes funcionales, principalmente con bases en el sistema formal
diseñado por Alonzo Church para definir cómputos y estudiar las
aplicaciones de las funciones llamado Cálculo Lambda. En este sistema
formal se puede expresar recursividad en las funciones, y entre otras
cosas interesantes, se pueden expresar combinadores — funciones sin
variables libres — como el Combinador de Punto Fijo o Y-Combinator,
que expresa recursividad sin hacer llamadas recursivas.
</p>

<p>
En el Cálculo Lambda existen tres transformaciones esenciales, la
conversión \(α\), la reducción \(β\) y la conversión \(η\). En la conversión
α se sustituyen los nombres de las variables para dar mas claridad a
la aplicación de las funciones, por ejemplo evitando duplicados en sus
nombres. En la reducción \(β\) se traza el llamado de las funciones
sustituyendo las funciones por sus expresiones resultantes.
</p>

<p>
Finalmente en las conversiones η se busca las equivalencias de trazado
de funciones sustituyéndolas por sus equivalentes. Estas
transformaciones también pueden ser aplicadas en los lenguajes
funcionales — o en su mayoría — dando lugar lenguajes que cuentan con
una gran expresividad y consistencia.
</p>


<p>
Les pondré el clásico ejemplo del chiste geek del castigo “Debo poner
atención en clases”. La respuesta geek expresada en PHP esta escrita a
continuación.  Donde PHP es un lenguaje dinámico, no necesita declarar
variables y es un lenguaje orientado a objetos con raíces imperativas.
Sus instrucciones son paso a paso, y no constituyen una única
expresión reducible.
</p>

<div class="org-src-container">
<pre class="src src-C">&lt;?php
    <span style="color: #7a88cf;">/* </span><span style="color: #7a88cf;">codigo PHP</span><span style="color: #7a88cf;"> */</span>
    <span style="color: #c099ff;">for</span> <span style="color: #c099ff;">(</span>$i = 0; $i &lt; 500; $i++<span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
        echo <span style="color: #c3e88d;">"Debo poner atenci&#243;n en clase"</span>;
    <span style="color: #c099ff;">}</span>
 ?&gt;
</pre>
</div>

<p>
Si usamos Haskell como ejemplo, que es un lenguaje funcional con
tipificación estática fuerte, requiere que las variables sean
declaradas con un tipo — la mayoría de las veces — y es muy expresivo,
donde el siguiente ejemplo dice repetir la cadena, tomar 500 elementos
y con esa lista ejecutar la función monádica putStrLn, que esta hecha
para el Monad IO e imprime  el mensaje las 500 veces solicitada.
</p>


<div class="org-src-container">
<pre class="src src-C"> <span style="color: #ffc777;">module</span> <span style="color: #82aaff;">Main</span> <span style="color: #c099ff;">(</span>main<span style="color: #c099ff;">)</span> where

 -- codigo Haskell

 main :: IO <span style="color: #c099ff;">()</span>
 main = mapM_ putStrLn $ take 500 $ repeat <span style="color: #c3e88d;">"Debo poner atenci&#243;n"</span>
</pre>
</div>


<p>
En Lisp sería similar, pero Lisp es de tipificación dinámica y no
necesita declarar variables, dando lugar a un programa muy simple de
una sola linea.  Donde también tenemos lenguajes como Clojure, que es
un dialecto de Lisp y soporta construcciones muy similares a las del
ejemplo en Lisp, dando lugar a programas expresivos y simples, pero
que corren sobre la máquina virtual de Java o JVM.
</p>


<div class="org-src-container">
<pre class="src src-lisp"> <span style="color: #7a88cf;">;;; </span><span style="color: #7a88cf;">codigo Lisp</span>

 <span style="color: #c099ff;">(</span><span style="color: #c099ff;">loop</span> repeat 500 do <span style="color: #ff995e;">(</span>format t <span style="color: #c3e88d;">"Debo poner atencion en clases~%"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>


<p>
Un ejemplo clásico para la conversión η en Haskell, es reducir las
llamadas a funciones en su combinador de identidad. Por ejemplo se
tiene la función \(f(g(x))\), que en Cálculo Lambda se expresa como
\(λx.(λy.y)x\), se puede reducir a \(g(x)\), que se expresa como \(λy.y\) en
Cálculo Lambda. Esto expresado en Haskell, se vería como el siguiente
ejemplo, donde absN y absN’ son funciones equivalentes y absN’ es la
reducción \(η\) de absN.
</p>



<div class="org-src-container">
<pre class="src src-haskell"> absN :: Num a =&gt; a -&gt; a
 absN n = abs n

 absN' :: Num a =&gt; a -&gt; a
 absN' = abs
</pre>
</div>


<p>
Actualmente los lenguajes orientados a objetos más comunes están
integrando características funcionales, como Java, que acaba de
incluir funciones anonimas.  Pero también están los lenguajes que a lo
largo de su historia han sido multi-paradigma, como Python, e
implementa características funcionales, procedurales y orientadas a
objetos. El bien conocido algoritmo para verificar si un RUT es válido
o no, se puede expresar funcionalmente en Python como esta escrito en
el siguiente ejemplo.
</p>


<div class="org-src-container">
<pre class="src src-python"> <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">val_rut</span><span style="color: #c099ff;">(</span>rut<span style="color: #c099ff;">)</span>:
     <span style="color: #9ba5db;">"""</span>
<span style="color: #9ba5db;">     Valida un string con un RUT con el guion incluido, retornando</span>
<span style="color: #9ba5db;">     cero si es valido.</span>

<span style="color: #9ba5db;">     Ejemplo: print(val_rut("22222222-2"))</span>
<span style="color: #9ba5db;">     """</span>
     <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">cmp</span><span style="color: #c099ff;">(</span>rut<span style="color: #ff995e;">[</span>-1<span style="color: #ff995e;">]</span>,
                <span style="color: #c099ff;">str</span><span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span><span style="color: #c099ff;">range</span><span style="color: #b4f9f8;">(</span>10<span style="color: #b4f9f8;">)</span> + <span style="color: #b4f9f8;">[</span><span style="color: #c3e88d;">'K'</span><span style="color: #b4f9f8;">]</span><span style="color: #ff98a4;">)[</span>
                    <span style="color: #b4f9f8;">(</span>11 - <span style="color: #c099ff;">sum</span><span style="color: #f989d3;">(</span><span style="color: #c099ff;">map</span><span style="color: #ffc777;">(</span><span style="color: #c099ff;">lambda</span> x: <span style="color: #82aaff;">(</span><span style="color: #c099ff;">int</span><span style="color: #77e0c6;">(</span>x<span style="color: #86e1fc;">[</span>0<span style="color: #86e1fc;">]</span><span style="color: #77e0c6;">)</span> * x<span style="color: #77e0c6;">[</span>1<span style="color: #77e0c6;">]</span><span style="color: #82aaff;">)</span>,
                                  <span style="color: #c099ff;">zip</span><span style="color: #82aaff;">(</span><span style="color: #c099ff;">reversed</span><span style="color: #77e0c6;">(</span>rut<span style="color: #86e1fc;">[</span>:-2<span style="color: #86e1fc;">]</span><span style="color: #77e0c6;">)</span>,
                                      <span style="color: #77e0c6;">(</span>2 * <span style="color: #c099ff;">range</span><span style="color: #86e1fc;">(</span>2, 8<span style="color: #86e1fc;">)</span><span style="color: #77e0c6;">)</span><span style="color: #82aaff;">)</span><span style="color: #ffc777;">)</span><span style="color: #f989d3;">)</span> % 11<span style="color: #b4f9f8;">)</span><span style="color: #ff98a4;">]</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

</pre>
</div>


<p>
Como se aprecia en el ejemplo, la validación se realiza utilizando
 expresiones o llamadas a funciones, sin uso de variables con estado y
 mutabilidad, donde cada llamada a una función se puede reducir a un
 valor determinado, y como resultado final se tiene un valor cero o
 distinto de cero que indica si el RUT es válido.  Este mismo
 algoritmo funcional, se puede expresar en Haskell con llamadas muy
 similares, debido a que los nombres de las funciones y funciones de
 alto orden son bastante comunes entre los lenguajes funcionales.
</p>


<div class="org-src-container">
<pre class="src src-haskell">valRut :: String -&gt; Bool
valRut s = (((['0'..'9'] ++ ['K'])
             !! (11 - sum(zipWith (*)
                          (fmap digitToInt $ drop 2 $ reverse s)
                          (take 10 $ cycle [2..7])) `mod` 11)) == (last s))
</pre>
</div>


<p>
De estos dos ejemplos, se puede decir que son funciones puras,
principalmente debido a que no tienen variables libres y son una única
expresión sin estado y no mutable a lo largo de la ejecución. El
problema de la pureza es conceptualmente algo que se idealiza en la
programación funcional, siendo abordado de diferentes formas por
diferentes lenguajes. El objetivo es mantener las funciones y rutinas
puras. En Haskell, con su abstracción más clásica conocida con el
nombre de Mónada, permite entregar pureza a expresiones que parecen no
ser puras, y en términos muy sencillos el Mónada reúne una identidad y
una composición de funciones del tipo \(f(g(x))\), todo a través de un
tipo de dato que permite componer funciones sin abandonar ese tipo de
dato y darle un aspecto procedural.
</p>
</div>
</div>
