index.html


<div id="outline-container-orge5d4a2b" class="outline-2">
<h2 id="orge5d4a2b">Lisp</h2>
<div class="outline-text-2" id="text-orge5d4a2b">
<p>
Lisp (históricamente LISP) es una familia de lenguajes de programación
de computadora de tipo multiparadigma con larga historia y una
inconfundible y útil sintaxis homoicónica basada en la notación
polaca.
</p>

<p>
Desarrollado originalmente en 1959 por John McCarthy y sus
colaboradores en el Instituto Tecnológico de Massachusetts, Lisp es el
segundo lenguaje de programación de alto nivel de mayor antigüedad;
apareció un año después de FORTRAN y uno antes que COBOL.
</p>

<p>
Al igual que COBOL y FORTRAN, Lisp ha cambiado mucho desde sus
comienzos, y han existido un gran número de dialectos en su
historia. Hoy, los dialectos de Lisp más ampliamente usados son Scheme
(1975), Common Lisp (1984), Emacs Lisp (1985) y Clojure (2007).
</p>

<p>
Lisp fue creado originalmente como una notación matemática práctica
para los programas de computadora, basada en el cálculo lambda de
Alonzo Church. Se convirtió rápidamente en el lenguaje de programación
favorito en la investigación de la inteligencia artificial (AI). Como
lenguajes de programación precursor, Lisp fue pionero en muchas ideas
en ciencias de la computación, incluyendo las estructuras de datos de
árbol, el manejo de almacenamiento automático, tipos dinámicos, y el
compilador auto contenido.
</p>

<p>
El acrónimo LISP significa "LISt Processor" ('Procesamiento de
listas'). Las listas encadenadas son una de las estructuras de datos
importantes de Lisp, y el código fuente de Lisp en sí mismo está
compuesto de listas. Como resultado, los programas de Lisp pueden
manipular código fuente de Lisp como si fueran simples datos, dando
lugar a sistemas de macros que permiten a los programadores crear
lenguajes de dominio específico embebidos en Lisp.
</p>

<p>
La intercambiabilidad del código y los datos también da a Lisp su
instantáneamente reconocible sintaxis. Todo el código del programa es
escrito como expresiones S, o listas entre paréntesis. Una llamada de
función o una forma sintáctica es escrita como una lista, con la
función o el nombre del operador en primer lugar, y los argumentos a
continuación; por ejemplo, una función f que toma tres argumentos
puede ser llamada usando (f x y z).
</p>
</div>

<div id="outline-container-org72f7a53" class="outline-3">
<h3 id="org72f7a53">Historia</h3>
<div class="outline-text-3" id="text-org72f7a53">
<p>
El proyecto se inició en 1987, cuando los autores originales, Bruno
Haible y Michael Stoll, aún eran estudiantes en Alemania. La versión
original sólo era para Atari ST y estaba escrito en lenguaje
ensamblador del Motorola 68000 y Lisp. En 1992 se anunció la versión
2.0 para Linux en comp.os.linux, aunque sólo en formato binario.
</p>

<p>
Inicialmente Bruno Haible no tenía la intención de distribuir CLISP
bajo la licencia GPL, pero tras un debate público en octubre de 1992
en la lista de correo del proyecto4​ con Richard Stallman, cambió de
opinión. El inicio de este debate fue la reclamación por parte de
Richard Stallman para que cambiase la licencia CLISP a la GPL al
considerar que era un trabajo derivado de la biblioteca GNU readline
que se había empezado a usar en el proyecto poco sobre aquellas
fechas.
</p>

<p>
En 1993 apareció la primera versión portable, en la que se incluía el
código fuente bajo licencia GNU GPL. Esta versión estaba disponible
para Atari ST, Amiga 500-2000, MS-DOS (emx, djgpp), OS/2 (emx), Unix
(Linux, Sun4, Sun386, HP9000/800). A finales de 1993 apareció la
versión 2.6 que incluía soporte para CLOS. Para finales de ese año
apareció la versión 2.8 que sumó el paquete COMMON-LISP, que es el
contiene las primitivas del sistema Common Lisp tal y como se definen
en la especificación del lenguaje. En la versión 2.14 de 1995 se
incorporó la interfaz FFI (Foreign Function Interface) que permite
llamar a funciones C desde CLISP y hacer disponibles funciones CLISP
desde C.
</p>

<p>
Desde el año 2000, el proyecto se aloja en sourceforge.net5​ que le
proporciona los recursos necesarios para poder continuar con su
desarrollo.
</p>


<p>
<a href="https://es.wikipedia.org/wiki/Lisp">Fuente</a>
</p>


<p>
clisp
</p>
</div>
</div>
