prolog.org
** Expresiones

 Es particularmente cierto que la mejor forma de aprender Lisp es
 usándolo, porque se trata de un lenguaje interactivo. Cualquier
 sistema Lisp, incluye una interfaz interactiva llamada top-level. Uno
 escribe expresiones Lisp en el top-level, y el sistema despliega sus
 valores. El sistema normalmente despliega un indicador llamado prompt
 (>) señalando que está esperando que una expresión sea escrita. Por
 ejemplo, si escribímos el entero 1 después del prompt y tecleamos
 enter, tenemos:

 #+BEGIN_SRC lisp
> 1
1
 #+END_SRC

 el sistema despliega el valor de la expresión, seguida de un nuevo prompt,
 indicando que está listo para evaluar una nueva expresión. En este caso, el
 sistema desplegó lo mismo que tecleamos porque los números, como otras
 constantes, evalúan a si mismos. Las cosas son más interesantes cuando una
 expresión

 #+BEGIN_SRC lisp
> (+ 2 3)
5
 #+END_SRC

 En la expresión (+ 2 3) el símbolo + es llamado el operador y los números 3 y 4 son sus argumentos (o parámetros actuales, siguendo la notación
 introducida en el capítulo anterior). Como el operador viene al principio de
 la expresión, esta notación se conoce como prefija y aunque parezca extraña,
 veremos que es muy práctica. Por ejemplo, si queremos sumar tres números
 en notación infija, necesitaríamos usar dos veces el operador +: 2+3+4. En
 Lisp, las siguientes sumas son válidas:

 #+BEGIN_SRC lisp
(+)
0
(+ 2)
2
(+ 2 3)
5
(+ 2 3 5)
10
 #+END_SRC

 Como los operadores pueden tomar un número variable de argumentos,
 es necesario utilizar los paréntesis para indicar donde inicia y donde termina
 una expresión. Las expresiones pueden anidarse, esto es, el argumento de
 una expresión puede ser otra expresión compleja. Ej.

 #+BEGIN_SRC lisp
(/ (- 7 1)(- 4 2))
3
 #+END_SRC

 En español esto corresponde a siete menos uno, dividido por cuatro
 menos dos.  Estética minimalista, esto es todo lo que hay que decir
 sobre la notación en Lisp. Toda expresión Lisp es un átomo, como 1, o
 bien es una lista que consiste de cero o más expresiones delimitadas
 por paréntesis. Como veremos, código y datos usan la misma notación en
 Lisp.


 4 + 5 / 34 + 67 * 2 
 4 + (/ 5 34) + (* 67 2)
 A= (/ 5 34)
 B= (* 67 2)
 4 + A + B
 (+ 4 A) + B
 C = (+ 4 A)
 C + B
 + C B
 + 4 5


 (load "/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp")

 Para cargar en un archivo y ejecutarlo en clisp se utiliza la función load. 

 #+BEGIN_SRC lisp
(load "path")
(load "/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp")
 #+END_SRC

 #+BEGIN_SRC lisp 
(defun hola()
(print "Hola mundo Prolog" )
)
(hola ')
 #+END_SRC




 #+BEGIN_SRC lisp
(defun suma(a b)
  (+ a b)
)
(suma 3 4)

 #+END_SRC

 #+RESULTS:
 : 7

 Resolver 

 1. 8, 3, -2,-7,-12,
 2. 3,6,12,24,48,
 3. 4,9,16,25,36,49,
 4. 5,10,17,26,37,50,
 5. 6,11,18,27,38,51,
 6. 3,8,15,24,35,48,
 7. -4,9,-16,25,-36,49,
 8. 4,-9,16,-25,36,-49,
 9. $\cfrac{2}{4},\cfrac{5}{9},\cfrac{8}{16},\cfrac{11}{25},\cfrac{14}{36}$
 10. $-5,\cfrac{7}{2},-\cfrac{9}{3},\cfrac{11}{4},-\cfrac{13}{5}$


 #+BEGIN_SRC lisp
(defparameter *pi* 3.1415)

(defun areaCirculo(r)
(* *pi* (* r r)  )
)

'(+ 5 6 )
eval
 #+END_SRC

 4 + 5 / 34 + 67 * 2 
 4 + (/ 5 34) + (* 67 2)
 A= (/ 5 34)
 B= (* 67 2)
 4 + A + B
 (+ 4 A) + B
 C = (+ 4 A)
 C + B
 + C B
 + 4 5


 (load "/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp")

 Para cargar en un archivo y ejecutarlo en clisp se utiliza la función load. 

 #+BEGIN_SRC lisp
(load "path")
(load "/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp")
 #+END_SRC

 #+BEGIN_SRC lisp 
(defun hola()
(print "Hola mundo Prolog" )
)
(hola ')
 #+END_SRC




 #+BEGIN_SRC lisp
(defun suma(a b)
  (+ a b)
)
(suma 3 4)

 #+END_SRC

 #+RESULTS:
 : 7

 Resolver 

 1. 8, 3, -2,-7,-12,
 2. 3,6,12,24,48,
 3. 4,9,16,25,36,49,
 4. 5,10,17,26,37,50,
 5. 6,11,18,27,38,51,
 6. 3,8,15,24,35,48,
 7. -4,9,-16,25,-36,49,
 8. 4,-9,16,-25,36,-49,
 9. $\cfrac{2}{4},\cfrac{5}{9},\cfrac{8}{16},\cfrac{11}{25},\cfrac{14}{36}$
 10. $-5,\cfrac{7}{2},-\cfrac{9}{3},\cfrac{11}{4},-\cfrac{13}{5}$


 #+BEGIN_SRC lisp
(defparameter *pi* 3.1415)

(defun areaCirculo(r)
(* *pi* (* r r)  )
)

'(+ 5 6 )
eval
 #+END_SRC

