index.html


<div id="outline-container-orgd39a0ec" class="outline-3">
<h3 id="orgd39a0ec">Programación en Lisp</h3>
</div>
<div id="outline-container-org6495722" class="outline-3">
<h3 id="org6495722">Expresiones</h3>
<div class="outline-text-3" id="text-org6495722">
<p>
Es particularmente cierto que la mejor forma de aprender Lisp es
usándolo, porque se trata de un lenguaje interactivo. Cualquier
sistema Lisp, incluye una interfaz interactiva llamada top-level. Uno
escribe expresiones Lisp en el top-level, y el sistema despliega sus
valores. El sistema normalmente despliega un indicador llamado prompt
(&gt;) señalando que está esperando que una expresión sea escrita. Por
ejemplo, si escribímos el entero 1 después del prompt y tecleamos
enter, tenemos:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt; 1
1
</pre>
</div>

<p>
el sistema despliega el valor de la expresión, seguida de un nuevo prompt,
indicando que está listo para evaluar una nueva expresión. En este caso, el
sistema desplegó lo mismo que tecleamos porque los números, como otras
constantes, evalúan a si mismos. Las cosas son más interesantes cuando una
expresión
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt; <span style="color: #c099ff;">(</span>+ 2 3<span style="color: #c099ff;">)</span>
5
</pre>
</div>

<p>
En la expresión (+ 2 3) el símbolo + es llamado el operador y los números 3 y 4 son sus argumentos (o parámetros actuales, siguendo la notación
introducida en el capítulo anterior). Como el operador viene al principio de
la expresión, esta notación se conoce como prefija y aunque parezca extraña,
veremos que es muy práctica. Por ejemplo, si queremos sumar tres números
en notación infija, necesitaríamos usar dos veces el operador +: 2+3+4. En
Lisp, las siguientes sumas son válidas:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>+<span style="color: #c099ff;">)</span>
0
<span style="color: #c099ff;">(</span>+ 2<span style="color: #c099ff;">)</span>
2
<span style="color: #c099ff;">(</span>+ 2 3<span style="color: #c099ff;">)</span>
5
<span style="color: #c099ff;">(</span>+ 2 3 5<span style="color: #c099ff;">)</span>
10
</pre>
</div>

<p>
Como los operadores pueden tomar un número variable de argumentos,
es necesario utilizar los paréntesis para indicar donde inicia y donde termina
una expresión. Las expresiones pueden anidarse, esto es, el argumento de
una expresión puede ser otra expresión compleja. Ej.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>/ <span style="color: #ff995e;">(</span>- 7 1<span style="color: #ff995e;">)(</span>- 4 2<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
3
</pre>
</div>

<p>
En español esto corresponde a siete menos uno, dividido por cuatro
menos dos.  Estética minimalista, esto es todo lo que hay que decir
sobre la notación en Lisp. Toda expresión Lisp es un átomo, como 1, o
bien es una lista que consiste de cero o más expresiones delimitadas
por paréntesis. Como veremos, código y datos usan la misma notación en
Lisp.
</p>


<p>
4 + 5 / 34 + 67 * 2 
4 + (/ 5 34) + (* 67 2)
A= (/ 5 34)
B= (* 67 2)
4 + A + B
(+ 4 A) + B
C = (+ 4 A)
C + B
</p>
<ul class="org-ul">
<li>C B</li>
<li>4 5</li>
</ul>


<p>
(load "/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp")
</p>

<p>
Para cargar en un archivo y ejecutarlo en clisp se utiliza la función load. 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>load <span style="color: #c3e88d;">"path"</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>load <span style="color: #c3e88d;">"/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp"</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">hola</span><span style="color: #ff995e;">()</span>
<span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Hola mundo Prolog"</span> <span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>hola '<span style="color: #c099ff;">)</span>
</pre>
</div>




<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">suma</span><span style="color: #ff995e;">(</span>a b<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>+ a b<span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>suma 3 4<span style="color: #c099ff;">)</span>

</pre>
</div>

<p>
Resolver 
</p>

<ol class="org-ol">
<li>8, 3, -2,-7,-12,</li>
<li>3,6,12,24,48,</li>
<li>4,9,16,25,36,49,</li>
<li>5,10,17,26,37,50,</li>
<li>6,11,18,27,38,51,</li>
<li>3,8,15,24,35,48,</li>
<li>-4,9,-16,25,-36,49,</li>
<li>4,-9,16,-25,36,-49,</li>
<li>\(\cfrac{2}{4},\cfrac{5}{9},\cfrac{8}{16},\cfrac{11}{25},\cfrac{14}{36}\)</li>
<li>\(-5,\cfrac{7}{2},-\cfrac{9}{3},\cfrac{11}{4},-\cfrac{13}{5}\)</li>
</ol>


<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defparameter</span> <span style="color: #ff98a4;">*pi*</span> 3.1415<span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">areaCirculo</span><span style="color: #ff995e;">(</span>r<span style="color: #ff995e;">)</span>
<span style="color: #ff995e;">(</span>* *pi* <span style="color: #ff98a4;">(</span>* r r<span style="color: #ff98a4;">)</span>  <span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>

'<span style="color: #c099ff;">(</span>+ 5 6 <span style="color: #c099ff;">)</span>
eval
</pre>
</div>

<p>
4 + 5 / 34 + 67 * 2 
4 + (/ 5 34) + (* 67 2)
A= (/ 5 34)
B= (* 67 2)
4 + A + B
(+ 4 A) + B
C = (+ 4 A)
C + B
</p>
<ul class="org-ul">
<li>C B</li>
<li>4 5</li>
</ul>


<p>
(load "/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp")
</p>

<p>
Para cargar en un archivo y ejecutarlo en clisp se utiliza la función load. 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>load <span style="color: #c3e88d;">"path"</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>load <span style="color: #c3e88d;">"/home/likcos/Materias/Prolog/public/src/ejemplo1.lisp"</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">hola</span><span style="color: #ff995e;">()</span>
<span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Hola mundo Prolog"</span> <span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>hola '<span style="color: #c099ff;">)</span>
</pre>
</div>




<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">suma</span><span style="color: #ff995e;">(</span>a b<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>+ a b<span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>suma 3 4<span style="color: #c099ff;">)</span>

</pre>
</div>

<p>
Resolver 
</p>

<ol class="org-ol">
<li>8, 3, -2,-7,-12,</li>
<li>3,6,12,24,48,</li>
<li>4,9,16,25,36,49,</li>
<li>5,10,17,26,37,50,</li>
<li>6,11,18,27,38,51,</li>
<li>3,8,15,24,35,48,</li>
<li>-4,9,-16,25,-36,49,</li>
<li>4,-9,16,-25,36,-49,</li>
<li>\(\cfrac{2}{4},\cfrac{5}{9},\cfrac{8}{16},\cfrac{11}{25},\cfrac{14}{36}\)</li>
<li>\(-5,\cfrac{7}{2},-\cfrac{9}{3},\cfrac{11}{4},-\cfrac{13}{5}\)</li>
</ol>


<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defparameter</span> <span style="color: #ff98a4;">*pi*</span> 3.1415<span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">areaCirculo</span><span style="color: #ff995e;">(</span>r<span style="color: #ff995e;">)</span>
<span style="color: #ff995e;">(</span>* *pi* <span style="color: #ff98a4;">(</span>* r r<span style="color: #ff98a4;">)</span>  <span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>

'<span style="color: #c099ff;">(</span>+ 5 6 <span style="color: #c099ff;">)</span>
eval
</pre>
</div>
</div>
</div>
