prolog.org
** Datos

 Lisp ofrece los tipos de datos que podemos encontrar en otros
 lenguajes de programación, y otros que no. Ya hemos usado enteros en
 los ejemplos precedentes. Lascadenas de caracteres se delimita por
 comillas, por ejemplo, “Hola mundo”. Enteros y cadenas evalúan a ellos
 mismos, como las constantes.  Dos tipos de datos propios de Lisp son
 los símbolos y las listas. Los símbolos son palabras. Normalmente se
 evaluan como si estuvieran escritos en mayúsculas, independientemente
 de como fueron tecleados:

 #+BEGIN_SRC lisp
'uno
uno
 #+END_SRC

 Los símbolos por lo general no evaluan a si mismos, así que si es
 necesario referirse a ellos, se debe usar quote, como en ejemplo
 anterior, de lo contrario, se producirá un error ya que el símbolo uno
 no está acotado (no tiene ligado ningún valor en este momento).

 Las listas se representan como cero o más elementos entre paréntesis. Los
 elementos pueden ser de cualquier tipo, incluidas las listas. Se debe usar
 quote con las listas, ya que de otra forma Lisp las tomaría como una llamada
 a función. Veamos algunos ejemplos:

 #+BEGIN_SRC lisp
’(Mis 2 "ciudades")
(MIS 2 "CIUDADES")
’(La lista (a b c) tiene 3 elementos)
(LA LISTA (A B C) TIENE 3 ELEMENTOS)
 #+END_SRC

 Observen que quote protege a toda la expresión, incluidas las
 sub-expresiones en ella. La lista (a b c), tampoco fue
 evaluada. También es posible construir listas usando la función list:

 #+BEGIN_SRC lisp
(list ’mis (+ 4 2) "colegas")
(MIS 6 COLEGAS)
 #+END_SRC

 Estética minimalista y pragmática, observen que los programas Lisp se
 representan como listas. Si el argumento estético no bastará para defender la
 notación de Lisp, esto debe bastar –Un programa Lisp puede generar código
 Lisp! Por eso es necesario quote. Si una lista es precedida por el operador
 quote, la evaluación regresa la misma lista, en otro caso, la lista es evaluada
 como si fuese código. Por ejemplo:

 #+BEGIN_SRC lisp
(list ’(+ 2 3) (+ 2 3))
((+ 2 3) 5)
 #+END_SRC

** Evaluación

	 Veamos más en detalle como las expresiones son evaluadas para
	 desplegar su valor en el top-level. En Lisp, + es una función y (+
	 2 3) es una llamada a la función. Cuando Lisp evalúa una llamada a
	 alguna función, lo hace en dos pasos:

	 - Los argumentos de la llamada son evaluados de izquierda a derecha.
	   En este caso, los valores de los argumentos son 2 y 3,
	   respectivamente.

	 - Los valores de los argumentos son pasados a la función nombrada por
	   el operador. En este caso la función + que regresa 5.

	 Si alguno de los argumentos es a su vez una llamada de función, será
	 evaluado con las mismas reglas. Ej. Al evaluar la expresión (/ (- 7 1) (- 4 2))
	 pasa lo siguiente.

	 1. Lisp evalúa el primer argumento de izquierda a derecha (- 7 1). 7 es
		evaluado como 7 y 1 como 1. Estos valores son pasados a la función -
		que regresa 6.
	 2. El siguiente argumento (- 4 2) es evaluado. 4 es evaluado como 4 y 2
		como 2. Estos valores son pasados a la función - que regresa 2.
	 3. Los valores 6 y 2 son pasados a la función / que regresa 3.


	 No todos los operadores en Lisp son funciones, pero la mayoría lo son.
	 Todas las llamadas a función son evaluadas de esta forma, que se conoce
	 como regla de evaluación de Lisp. Los operadores que no siguen la regla de
	 evaluación se conocen como operadores especiales. Uno de estos operadores
	 especiales es quote (’). La regla de evaluación de quote es –No evalues nada,
	 despliega lo que el usuario tecleo, verbatim. 

     #+BEGIN_SRC lisp
(quote (+ 2 3))
(+ 2 3)
'( + 2 3)
(+ 2 3)
     #+END_SRC

	 Lisp provee el operador quote como una forma de evitar que una
	 expresión sea evaluada. En la siguiente sección veremos porque esta
	 protección puede ser útil.

** Funciones en Lisp
 Es posible definir nuevas funciones con defun que toma normalmente tres
 argumentos: un nombre, una lista de parámetros y una o más expresiones
 que conforman el cuerpo de la función. Ej. Así definiríamos tercero:

 #+BEGIN_SRC lisp
(defun tercero(lst)
  (caddr lst)
)
 #+END_SRC

 El primer argumento de defun indica que el nombre de nuestra función
 definida será tercero. El segundo argumento (lst) indica que la
 función tiene un sólo argumento, lst. Un símbolo usado de esta forma
 se conoce como variable. Cuando la variable representa el argumento de
 una función, se conoce como parámetro. El resto de la definición
 indica lo que se debe hacer para calcular el valor de la función, en
 este caso, para cualquier lst, se calculará el primer elemento, del
 resto, del resto del parámetro (caddr lst).

 #+BEGIN_SRC lisp
(tercero '(a b c d e))
C
 #+END_SRC

 Ahora que hemos introducido el concepto de variable, es más sencillo
 entender lo que es un símbolo. Los símbolos son nombres de variables, que
 existen con derechos propios en el lenguaje Lisp. Por ello símbolos y listas
 deben protegerse con quote para ser accesados. Una lista debe protegerse
 porque de otra forma es procesada como si fuese código; un símbolo debe
 protegerse porque de otra forma es procesado como si fuese una variable.
 Podríamos decir que la definición de una función corresponde a la versión
 generalizada de una expresión Lisp. Ej. La siguiente expresión verifica si la
 suma de 1 y 4 es mayor que 3:

 #+BEGIN_SRC lisp
( >(+ 1 4) 3)
 #+END_SRC

 Substituyendo los números partículares por variables, podemos definir
 una función que verifica si la suma de sus dos primeros argumentos es
 mayor que el tercero:

 #+BEGIN_SRC lisp
(defun suma-mayor-que (x  y z)
  (> (+ x y) z)
)
(suma-mayor-que 1 4 3)
 #+END_SRC

 Lisp no distigue entre programa, procedimiento y función; todos cuentan
 como funciones y de hecho, casi todo el lenguaje está compuesto de funciones. Si se desea considerar una función en partícular como main, es posible
 hacerlo, pero cualquier función puede ser llamada desde el top-level. Entre
 otras cosas, esto significa que posible probar nuestros programas, pieza por
 pieza, conforme los vamos escribiendo, lo que se conoce como programación
 incremental (bottom-up).

