index.html

<div id="outline-container-org58721f0" class="outline-3">
<h3 id="org58721f0">Datos</h3>
<div class="outline-text-3" id="text-org58721f0">
<p>
Lisp ofrece los tipos de datos que podemos encontrar en otros
lenguajes de programación, y otros que no. Ya hemos usado enteros en
los ejemplos precedentes. Lascadenas de caracteres se delimita por
comillas, por ejemplo, “Hola mundo”. Enteros y cadenas evalúan a ellos
mismos, como las constantes.  Dos tipos de datos propios de Lisp son
los símbolos y las listas. Los símbolos son palabras. Normalmente se
evaluan como si estuvieran escritos en mayúsculas, independientemente
de como fueron tecleados:
</p>

<div class="org-src-container">
<pre class="src src-lisp">'uno
uno
</pre>
</div>

<p>
Los símbolos por lo general no evaluan a si mismos, así que si es
necesario referirse a ellos, se debe usar quote, como en ejemplo
anterior, de lo contrario, se producirá un error ya que el símbolo uno
no está acotado (no tiene ligado ningún valor en este momento).
</p>

<p>
Las listas se representan como cero o más elementos entre paréntesis. Los
elementos pueden ser de cualquier tipo, incluidas las listas. Se debe usar
quote con las listas, ya que de otra forma Lisp las tomaría como una llamada
a función. Veamos algunos ejemplos:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&#8217;<span style="color: #c099ff;">(</span>Mis 2 <span style="color: #c3e88d;">"ciudades"</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>MIS 2 <span style="color: #c3e88d;">"CIUDADES"</span><span style="color: #c099ff;">)</span>
&#8217;<span style="color: #c099ff;">(</span>La lista <span style="color: #ff995e;">(</span>a b c<span style="color: #ff995e;">)</span> tiene 3 elementos<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>LA LISTA <span style="color: #ff995e;">(</span>A B C<span style="color: #ff995e;">)</span> TIENE 3 ELEMENTOS<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Observen que quote protege a toda la expresión, incluidas las
sub-expresiones en ella. La lista (a b c), tampoco fue
evaluada. También es posible construir listas usando la función list:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>list &#8217;mis <span style="color: #ff995e;">(</span>+ 4 2<span style="color: #ff995e;">)</span> <span style="color: #c3e88d;">"colegas"</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>MIS 6 COLEGAS<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Estética minimalista y pragmática, observen que los programas Lisp se
representan como listas. Si el argumento estético no bastará para defender la
notación de Lisp, esto debe bastar –Un programa Lisp puede generar código
Lisp! Por eso es necesario quote. Si una lista es precedida por el operador
quote, la evaluación regresa la misma lista, en otro caso, la lista es evaluada
como si fuese código. Por ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>list &#8217;<span style="color: #ff995e;">(</span>+ 2 3<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">(</span>+ 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span><span style="color: #ff995e;">(</span>+ 2 3<span style="color: #ff995e;">)</span> 5<span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org620af45" class="outline-3">
<h3 id="org620af45">Evaluación</h3>
<div class="outline-text-3" id="text-org620af45">
<p>
Veamos más en detalle como las expresiones son evaluadas para
desplegar su valor en el top-level. En Lisp, + es una función y (+
2 3) es una llamada a la función. Cuando Lisp evalúa una llamada a
alguna función, lo hace en dos pasos:
</p>

<ul class="org-ul">
<li>Los argumentos de la llamada son evaluados de izquierda a derecha.
En este caso, los valores de los argumentos son 2 y 3,
respectivamente.</li>

<li>Los valores de los argumentos son pasados a la función nombrada por
el operador. En este caso la función + que regresa 5.</li>
</ul>

<p>
Si alguno de los argumentos es a su vez una llamada de función, será
evaluado con las mismas reglas. Ej. Al evaluar la expresión (/ (- 7 1) (- 4 2))
pasa lo siguiente.
</p>

<ol class="org-ol">
<li>Lisp evalúa el primer argumento de izquierda a derecha (- 7 1). 7 es
evaluado como 7 y 1 como 1. Estos valores son pasados a la función -
que regresa 6.</li>
<li>El siguiente argumento (- 4 2) es evaluado. 4 es evaluado como 4 y 2
como 2. Estos valores son pasados a la función - que regresa 2.</li>
<li>Los valores 6 y 2 son pasados a la función / que regresa 3.</li>
</ol>


<p>
No todos los operadores en Lisp son funciones, pero la mayoría lo son.
Todas las llamadas a función son evaluadas de esta forma, que se conoce
como regla de evaluación de Lisp. Los operadores que no siguen la regla de
evaluación se conocen como operadores especiales. Uno de estos operadores
especiales es quote (’). La regla de evaluación de quote es –No evalues nada,
despliega lo que el usuario tecleo, verbatim. 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>quote <span style="color: #ff995e;">(</span>+ 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>+ 2 3<span style="color: #c099ff;">)</span>
'<span style="color: #c099ff;">(</span> + 2 3<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>+ 2 3<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Lisp provee el operador quote como una forma de evitar que una
expresión sea evaluada. En la siguiente sección veremos porque esta
protección puede ser útil.
</p>
</div>
</div>

<div id="outline-container-orgdb54eef" class="outline-3">
<h3 id="orgdb54eef">Funciones en Lisp</h3>
<div class="outline-text-3" id="text-orgdb54eef">
<p>
Es posible definir nuevas funciones con defun que toma normalmente tres
argumentos: un nombre, una lista de parámetros y una o más expresiones
que conforman el cuerpo de la función. Ej. Así definiríamos tercero:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">tercero</span><span style="color: #ff995e;">(</span>lst<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>caddr lst<span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
El primer argumento de defun indica que el nombre de nuestra función
definida será tercero. El segundo argumento (lst) indica que la
función tiene un sólo argumento, lst. Un símbolo usado de esta forma
se conoce como variable. Cuando la variable representa el argumento de
una función, se conoce como parámetro. El resto de la definición
indica lo que se debe hacer para calcular el valor de la función, en
este caso, para cualquier lst, se calculará el primer elemento, del
resto, del resto del parámetro (caddr lst).
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>tercero '<span style="color: #ff995e;">(</span>a b c d e<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
C
</pre>
</div>

<p>
Ahora que hemos introducido el concepto de variable, es más sencillo
entender lo que es un símbolo. Los símbolos son nombres de variables, que
existen con derechos propios en el lenguaje Lisp. Por ello símbolos y listas
deben protegerse con quote para ser accesados. Una lista debe protegerse
porque de otra forma es procesada como si fuese código; un símbolo debe
protegerse porque de otra forma es procesado como si fuese una variable.
Podríamos decir que la definición de una función corresponde a la versión
generalizada de una expresión Lisp. Ej. La siguiente expresión verifica si la
suma de 1 y 4 es mayor que 3:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span> &gt;<span style="color: #ff995e;">(</span>+ 1 4<span style="color: #ff995e;">)</span> 3<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Substituyendo los números partículares por variables, podemos definir
una función que verifica si la suma de sus dos primeros argumentos es
mayor que el tercero:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">suma-mayor-que</span> <span style="color: #ff995e;">(</span>x  y z<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>&gt; <span style="color: #ff98a4;">(</span>+ x y<span style="color: #ff98a4;">)</span> z<span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>suma-mayor-que 1 4 3<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Lisp no distigue entre programa, procedimiento y función; todos cuentan
como funciones y de hecho, casi todo el lenguaje está compuesto de funciones. Si se desea considerar una función en partícular como main, es posible
hacerlo, pero cualquier función puede ser llamada desde el top-level. Entre
otras cosas, esto significa que posible probar nuestros programas, pieza por
pieza, conforme los vamos escribiendo, lo que se conoce como programación
incremental (bottom-up).
</p>
</div>
</div>
