prolog.org
** Listas

En Lisp, las listas son una estructura de datos fundamental y
versátil. Se utilizan para almacenar una secuencia de elementos, que
pueden ser datos simples como números o cadenas de texto, así como
otras listas, lo que permite crear estructuras de datos
jerárquicas. Las listas en Lisp se representan mediante paréntesis y
los elementos se separan mediante espacios. Aquí tienes una
descripción básica de las listas en Lisp:

1. Sintaxis: Las listas en Lisp se representan mediante paréntesis. La
   lista comienza con un paréntesis abierto "(" y termina con un
   paréntesis cerrado ")". Los elementos de la lista se separan
   mediante espacios.

Ejemplo de una lista simple en Lisp:

#+BEGIN_SRC lisp
(1 2 3 4 5)
#+END_SRC


2. Listas anidadas: Puedes anidar listas dentro de otras listas para
   crear estructuras de datos más complejas. Esto permite representar
   datos jerárquicos.

Ejemplo de una lista anidada en Lisp:

#+BEGIN_SRC lisp
(1 (2 3) 4 (5 (6 7)))
#+END_SRC


3. Listas vacías: Una lista vacía se representa simplemente como un
   par de paréntesis sin ningún elemento en su interior.

Ejemplo de una lista vacía en Lisp:

#+BEGIN_SRC lisp
()
#+END_SRC


4. Funciones y listas: En Lisp, las listas se utilizan comúnmente para
   representar programas y datos. Las funciones se llaman aplicando
   una lista, donde el primer elemento de la lista es el nombre de la
   función y los elementos subsiguientes son los argumentos.

Ejemplo de una llamada a función en Lisp:

#+BEGIN_SRC lisp
(+ 1 2)
; En este caso, "+" es la función que suma los números 1 y 2.
#+END_SRC

5. Manipulación de listas: Lisp proporciona una variedad de funciones
   para trabajar con listas, como **car** (para obtener el primer
   elemento de una lista), **cdr** (para obtener todos los elementos
   excepto el primero), **cons** (para construir nuevas listas),
   `append` (para concatenar listas), entre otras.

En resumen, las listas en Lisp son una parte fundamental de la
programación y se utilizan para representar datos y programas. Su
flexibilidad y capacidad para anidarse las hacen muy poderosas en la
programación en Lisp.

** Cons


La función `cons` se utiliza para crear nuevas listas al agregar un
elemento al principio de una lista existente. Su sintaxis es la
siguiente:

#+BEGIN_SRC lisp
(cons elemento lista)
#+END_SRC

- **elemento** es el elemento que deseas agregar al principio de la lista.
- **lista** es la lista existente a la cual deseas agregar el elemento.

La función **cons** toma el elemento especificado y lo coloca al
principio de la lista proporcionada, devolviendo una nueva lista que
contiene el elemento recién añadido al principio. La lista original no
se modifica; en su lugar, se crea una nueva lista con el nuevo
elemento.

Un ejemplo de cómo se utiliza la función **cons***:

#+BEGIN_SRC lisp
(setq lista-original '(2 3 4))
(setq nueva-lista (cons 1 lista-original))
#+END_SRC

En este ejemplo, **lista-original** contiene **(2 3 4)**. Luego, usamos
`cons` para agregar el número **1** al principio de **lista-original**,
creando una nueva lista llamada **nueva-lista**. Después de esta
operación, **nueva-lista** será **(1 2 3 4)** y **lista-original** seguirá
siendo **(2 3 4)**.

La función **cons** es útil para construir y modificar listas en Lisp y
se utiliza con frecuencia en la programación en este lenguaje para
crear estructuras de datos y manipular listas de manera eficiente.





** Funciones CAR y CDR


  CAR admite un único argumento que debe ser una lista o una expresión
  cuyo valor sea una lista y devuelve el primer elemento de dicha
  lista. Como LISP siempre interpreta una lista como una llamada a una
  función, necesitamos una manera de pasar una lista a CAR sin que LISP
  trate de procesarla como llamada a función.

  CDR recibe también una lista y devuelve el resto de la lista después
  de eliminar el primer elemento (CAR lista). Por lo tanto puede
  contemplarse como la función complementaria de CAR. Una manera de
  interpretar una lista en LISP es como la conjunción de un CAR y un
  CDR. Se podrá acceder a cualquier término de una lista mediante los
  anidamientos apropiados de CAR y CDR.  

  - (CAR lista) ;primer término
  - (CAR (CDR lista)) ;segundo término 
  - (CAR (CDR (CDR lista))) ; tercer término 

  Para simplificar las expresiones se permite crear 
  nombres compuestos
  para anidamientos de CAR y CDR de la siguiente manera:
  - comenzando por una primera letra C 
  - una letra A por cada CAR o una D por cada CDR 
  - terminando con una letra R 
  - así (CAR (CDR (CDR lista))) sería lo mismo que (CADDR lista).

  De esta manera podemos construir hasta 28 funciones distintas para acceso a
  listas. Según Johnson estas 28 concatenaciones se pueden dividir en
  cuatro grupos, tomando como base la profundidad a que pueden acceder
  en listas anidadas en varios niveles.


  #+BEGIN_SRC lisp
;(eval (car '((+ 1 2) 2 3 4 5)))
(cadr '(1 2 3 4 5))
;(cddd  '((1 2 3 4 5) (6 7 8 9 10) (11 12 13 14 15)))

  #+END_SRC

  #+RESULTS:
  : 2


  #+BEGIN_SRC lisp
(defun)


  #+END_SRC


  #+BEGIN_SRC lisp :results output
(defun mylength (list)
(if list 
	(1+ (mylength (cdr list)))
	0))

(defun rec(list)
(print (car list))
(if list 
(rec ( cdr list))
)
)
(defvar a 4)
(format T "Hola mundo ~ d" a)
(rec '((1 2 3 4 4)))
;(mylength '(1 2 3 4))

  #+END_SRC

  #+RESULTS:
  : Hola mundo 4
  : (1 2 3 4 4) 
  : NIL 

*** Ejercicios car cdr
**** Problema 1: Acceder al cuarto elemento de una lista
  Dada la lista `(a b c d e f g)`, escribe una expresión para devolver el cuarto elemento utilizando solo `car` y `cdr`.

