index.html

<div id="outline-container-org8587f7c" class="outline-3">
<h3 id="org8587f7c">Listas</h3>
<div class="outline-text-3" id="text-org8587f7c">
<p>
En Lisp, las listas son una estructura de datos fundamental y
versátil. Se utilizan para almacenar una secuencia de elementos, que
pueden ser datos simples como números o cadenas de texto, así como
otras listas, lo que permite crear estructuras de datos
jerárquicas. Las listas en Lisp se representan mediante paréntesis y
los elementos se separan mediante espacios. Aquí tienes una
descripción básica de las listas en Lisp:
</p>

<ol class="org-ol">
<li>Sintaxis: Las listas en Lisp se representan mediante paréntesis. La
lista comienza con un paréntesis abierto "(" y termina con un
paréntesis cerrado ")". Los elementos de la lista se separan
mediante espacios.</li>
</ol>

<p>
Ejemplo de una lista simple en Lisp:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>1 2 3 4 5<span style="color: #c099ff;">)</span>
</pre>
</div>


<ol class="org-ol">
<li>Listas anidadas: Puedes anidar listas dentro de otras listas para
crear estructuras de datos más complejas. Esto permite representar
datos jerárquicos.</li>
</ol>

<p>
Ejemplo de una lista anidada en Lisp:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>1 <span style="color: #ff995e;">(</span>2 3<span style="color: #ff995e;">)</span> 4 <span style="color: #ff995e;">(</span>5 <span style="color: #ff98a4;">(</span>6 7<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>


<ol class="org-ol">
<li>Listas vacías: Una lista vacía se representa simplemente como un
par de paréntesis sin ningún elemento en su interior.</li>
</ol>

<p>
Ejemplo de una lista vacía en Lisp:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">()</span>
</pre>
</div>


<ol class="org-ol">
<li>Funciones y listas: En Lisp, las listas se utilizan comúnmente para
representar programas y datos. Las funciones se llaman aplicando
una lista, donde el primer elemento de la lista es el nombre de la
función y los elementos subsiguientes son los argumentos.</li>
</ol>

<p>
Ejemplo de una llamada a función en Lisp:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>+ 1 2<span style="color: #c099ff;">)</span>
<span style="color: #7a88cf;">; </span><span style="color: #7a88cf;">En este caso, "+" es la funci&#243;n que suma los n&#250;meros 1 y 2.</span>
</pre>
</div>

<ol class="org-ol">
<li>Manipulación de listas: Lisp proporciona una variedad de funciones
para trabajar con listas, como <b><b>car</b></b> (para obtener el primer
elemento de una lista), <b><b>cdr</b></b> (para obtener todos los elementos
excepto el primero), <b><b>cons</b></b> (para construir nuevas listas),
`append` (para concatenar listas), entre otras.</li>
</ol>

<p>
En resumen, las listas en Lisp son una parte fundamental de la
programación y se utilizan para representar datos y programas. Su
flexibilidad y capacidad para anidarse las hacen muy poderosas en la
programación en Lisp.
</p>
</div>
</div>

<div id="outline-container-org2b0d9b3" class="outline-3">
<h3 id="org2b0d9b3">Cons</h3>
<div class="outline-text-3" id="text-org2b0d9b3">
<p>
La función `cons` se utiliza para crear nuevas listas al agregar un
elemento al principio de una lista existente. Su sintaxis es la
siguiente:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>cons elemento lista<span style="color: #c099ff;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>elemento</b></b> es el elemento que deseas agregar al principio de la lista.</li>
<li><b><b>lista</b></b> es la lista existente a la cual deseas agregar el elemento.</li>
</ul>

<p>
La función <b><b>cons</b></b> toma el elemento especificado y lo coloca al
principio de la lista proporcionada, devolviendo una nueva lista que
contiene el elemento recién añadido al principio. La lista original no
se modifica; en su lugar, se crea una nueva lista con el nuevo
elemento.
</p>

<p>
Un ejemplo de cómo se utiliza la función <b><b>cons*</b></b>:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq lista-original '<span style="color: #ff995e;">(</span>2 3 4<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>setq nueva-lista <span style="color: #ff995e;">(</span>cons 1 lista-original<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
En este ejemplo, <b><b>lista-original</b></b> contiene <b><b>(2 3 4)</b></b>. Luego, usamos
`cons` para agregar el número <b><b>1</b></b> al principio de <b><b>lista-original</b></b>,
creando una nueva lista llamada <b><b>nueva-lista</b></b>. Después de esta
operación, <b><b>nueva-lista</b></b> será <b><b>(1 2 3 4)</b></b> y <b><b>lista-original</b></b> seguirá
siendo <b><b>(2 3 4)</b></b>.
</p>

<p>
La función <b><b>cons</b></b> es útil para construir y modificar listas en Lisp y
se utiliza con frecuencia en la programación en este lenguaje para
crear estructuras de datos y manipular listas de manera eficiente.
</p>
</div>
</div>





<div id="outline-container-org70fbe69" class="outline-3">
<h3 id="org70fbe69">Funciones CAR y CDR</h3>
<div class="outline-text-3" id="text-org70fbe69">
<p>
CAR admite un único argumento que debe ser una lista o una expresión
cuyo valor sea una lista y devuelve el primer elemento de dicha
lista. Como LISP siempre interpreta una lista como una llamada a una
función, necesitamos una manera de pasar una lista a CAR sin que LISP
trate de procesarla como llamada a función.
</p>

<p>
CDR recibe también una lista y devuelve el resto de la lista después
de eliminar el primer elemento (CAR lista). Por lo tanto puede
contemplarse como la función complementaria de CAR. Una manera de
interpretar una lista en LISP es como la conjunción de un CAR y un
CDR. Se podrá acceder a cualquier término de una lista mediante los
anidamientos apropiados de CAR y CDR.  
</p>

<ul class="org-ul">
<li>(CAR lista) ;primer término</li>
<li>(CAR (CDR lista)) ;segundo término</li>
<li>(CAR (CDR (CDR lista))) ; tercer término</li>
</ul>

<p>
Para simplificar las expresiones se permite crear 
nombres compuestos
para anidamientos de CAR y CDR de la siguiente manera:
</p>
<ul class="org-ul">
<li>comenzando por una primera letra C</li>
<li>una letra A por cada CAR o una D por cada CDR</li>
<li>terminando con una letra R</li>
<li>así (CAR (CDR (CDR lista))) sería lo mismo que (CADDR lista).</li>
</ul>

<p>
De esta manera podemos construir hasta 28 funciones distintas para acceso a
listas. Según Johnson estas 28 concatenaciones se pueden dividir en
cuatro grupos, tomando como base la profundidad a que pueden acceder
en listas anidadas en varios niveles.
</p>


<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #7a88cf;">;</span><span style="color: #7a88cf;">(eval (car '((+ 1 2) 2 3 4 5)))</span>
<span style="color: #c099ff;">(</span>cadr '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #7a88cf;">;</span><span style="color: #7a88cf;">(cddd  '((1 2 3 4 5) (6 7 8 9 10) (11 12 13 14 15)))</span>

</pre>
</div>


<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span><span style="color: #c099ff;">)</span>


</pre>
</div>


<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">mylength</span> <span style="color: #ff995e;">(</span>list<span style="color: #ff995e;">)</span>
<span style="color: #ff995e;">(</span><span style="color: #c099ff;">if</span> list 
    <span style="color: #ff98a4;">(</span>1+ <span style="color: #b4f9f8;">(</span>mylength <span style="color: #f989d3;">(</span>cdr list<span style="color: #f989d3;">)</span><span style="color: #b4f9f8;">)</span><span style="color: #ff98a4;">)</span>
    0<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">rec</span><span style="color: #ff995e;">(</span>list<span style="color: #ff995e;">)</span>
<span style="color: #ff995e;">(</span>print <span style="color: #ff98a4;">(</span>car list<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
<span style="color: #ff995e;">(</span><span style="color: #c099ff;">if</span> list 
<span style="color: #ff98a4;">(</span>rec <span style="color: #b4f9f8;">(</span> cdr list<span style="color: #b4f9f8;">)</span><span style="color: #ff98a4;">)</span>
<span style="color: #ff995e;">)</span>
<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span><span style="color: #c099ff;">defvar</span> <span style="color: #ff98a4;">a</span> 4<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>format T <span style="color: #c3e88d;">"Hola mundo ~ d"</span> a<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>rec '<span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span>1 2 3 4 4<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #7a88cf;">;</span><span style="color: #7a88cf;">(mylength '(1 2 3 4))</span>

</pre>
</div>
</div>

<div id="outline-container-org174a44f" class="outline-4">
<h4 id="org174a44f">Ejercicios car cdr</h4>
<div class="outline-text-4" id="text-org174a44f">
</div>
<ul class="org-ul">
<li><a id="orgdcc3f48"></a>Problema 1: Acceder al cuarto elemento de una lista<br />
<div class="outline-text-5" id="text-orgdcc3f48">
<p>
Dada la lista `(a b c d e f g)`, escribe una expresión para devolver el cuarto elemento utilizando solo `car` y `cdr`.
</p>
</div>
</li>
