index.html

<li><a id="org9189442"></a>Problema 2: Obtener los tres últimos elementos de una lista<br />
<div class="outline-text-5" id="text-org9189442">
<p>
Dada la lista `(1 2 3 4 5 6)`, utiliza combinaciones de `car` y `cdr` para devolver los tres últimos elementos.
</p>
</div>
</li>

<li><a id="orgc9d1c66"></a>Problema 3: Construir una lista a partir de los tres primeros elementos<br />
<div class="outline-text-5" id="text-orgc9d1c66">
<p>
Dada la lista `(a b c d e)`, construye una nueva lista que contenga solo los tres primeros elementos.
</p>
</div>
</li>

<li><a id="org5dd22a4"></a>Problema 4: Eliminar el primer y último elemento de una lista<br />
<div class="outline-text-5" id="text-org5dd22a4">
<p>
Dada la lista `(x y z w)`, escribe una expresión que elimine el primer y último elemento.
</p>
</div>
</li>

<li><a id="org8166804"></a>Problema 5: Verificar si una lista tiene al menos tres elementos<br />
<div class="outline-text-5" id="text-org8166804">
<p>
Escribe una función que reciba una lista y verifique si tiene al menos tres elementos usando `car` y `cdr`.
</p>
</div>
</li>

<li><a id="orgdab74e8"></a>Problema 6: Sumar los primeros tres números de una lista<br />
<div class="outline-text-5" id="text-orgdab74e8">
<p>
Dada la lista `(10 20 30 40)`, utiliza `car` y `cdr` para obtener la suma de los tres primeros números.
</p>
</div>
</li>
<li><a id="org984a8eb"></a>Problema 7: Acceder al penúltimo elemento de una lista<br />
<div class="outline-text-5" id="text-org984a8eb">
<p>
Dada la lista `(p q r s t)`, escribe una expresión que devuelva el penúltimo elemento.
</p>
</div>
</li>
<li><a id="org0474aeb"></a>Problema 8: Crear una lista anidada<br />
<div class="outline-text-5" id="text-org0474aeb">
<p>
Dada la lista `(1 2 3)`, usa `cons`, `car`, y `cdr` para crear la lista anidada `((1) (2) (3))`.
</p>
</div>
</li>

<li><a id="org911059d"></a>Problema 9: Fusionar dos listas<br />
<div class="outline-text-5" id="text-org911059d">
<p>
Dadas las listas `(a b c)` y `(x y z)`, escribe una expresión que las combine en una sola lista `(a b c x y z)` utilizando `cons`, `car`, y `cdr`.
</p>
</div>
</li>
<li><a id="org01a7c78"></a>Problema 10: Invertir los dos primeros pares de elementos de una lista<br />
<div class="outline-text-5" id="text-org01a7c78">
<p>
Dada la lista `(1 2 3 4 5 6)`, invierte los primeros dos pares de elementos de la lista, de modo que obtengas `(2 1 4 3 5 6)`.
</p>
</div>
</li>
</ul>
</div>
</div>




<div id="outline-container-org274a1e8" class="outline-3">
<h3 id="org274a1e8">Entradas y salidas</h3>
<div class="outline-text-3" id="text-org274a1e8">
<p>
Lisp proporciona un amplio conjunto de facilidades para realizar
entrada/salida. Todas las operaciones de entrada/salida se realizan en
flujos de varios tipos. Aunque es posible leer y escribir datos
binarios, la mayoría de los métodos de entrada/salida de Common Lisp
leen o escriben caracteres. Para leer y escribir caracteres
individuales o líneas de datos, existen primitivas directas. Sin
embargo, la operación de entrada/salida más útil es leer y escribir
representaciones escritas de objetos Lisp arbitrarios.
</p>

<p>
<b><b>Objetos Lisp:</b></b>
</p>

<p>
Los objetos Lisp suelen ser estructuras de datos complejas en lugar de
cadenas de texto. Difieren de las cadenas de texto en términos de
atributos debido a cómo se representan internamente. Sin embargo, Lisp
ofrece una representación de la mayoría de los objetos en forma de
texto escrito, conocida como la representación impresa, que se utiliza
en las facilidades de entrada/salida. Esto hace posible acceder y
discutir objetos Lisp.
</p>

<p>
Los caracteres de la representación impresa de un objeto Lisp se
transmiten a un flujo mediante funciones como "print". El (Lisp)
impresor es un conjunto de funciones que realiza esto. El (Lisp)
lector es un conjunto de rutinas que realiza la función de lectura,
que acepta caracteres de un flujo, los interpreta como una
representación impresa de un objeto Lisp, crea ese objeto y lo
devuelve.
</p>
</div>
