index.html

<div id="outline-container-orgdaaed08" class="outline-4">
<h4 id="orgdaaed08">Funciones de Entrada:</h4>
<div class="outline-text-4" id="text-orgdaaed08">
<p>
Los caracteres de la representación impresa de un objeto Lisp se
transmiten a un flujo mediante funciones como "print". El (Lisp)
impresor es un conjunto de funciones que realiza esta tarea. El (Lisp)
lector es un conjunto de rutinas que ejecutan la función de lectura,
la cual acepta caracteres de un flujo, los interpreta como la
representación impresa de un objeto Lisp, crea ese objeto y lo
devuelve.
</p>

<p>
<b><b>Funciones de Entrada</b></b>: Las funciones de entrada se dividen en dos
categorías: aquellas que trabajan con flujos de caracteres y aquellas
que trabajan con flujos binarios.
</p>

<p>
<b><b>Entrada desde Flujos de Caracteres</b></b>: Existen muchos argumentos
opcionales en las funciones de entrada de caracteres llamados
"input-stream", "eof-error-p" y "eof-value". El argumento
"input-stream" es el flujo desde el cual recoger la entrada; si no se
especifica o es "nil", se toma por defecto el valor de la variable
especial 'standard-input'. El parámetro "eof-error-p" controla lo que
sucede si la entrada proviene de un archivo y se alcanza el final del
archivo. Si "eof-error-p" es verdadero, que es el valor
predeterminado, se señalará un error al final del archivo. Si es
falso, entonces no se encuentra ningún error, y en su lugar, la
función devuelve "eof-value".
</p>

<p>
Las funciones read, read-line y read-char son funciones de entrada en
Lisp que se utilizan para leer datos desde un flujo. Aquí se describen
sus parámetros:
</p>

<ul class="org-ul">
<li><b><b>read &amp;optional input-stream eof-error-p eof-value recursive-p</b></b>:
Esta función lee datos desde el flujo de entrada especificado en
input-stream. Si no se especifica input-stream, se utiliza el valor
predeterminado que es el flujo de entrada estándar. eof-error-p
controla si se produce un error cuando se alcanza el final del
archivo (true por defecto), y eof-value especifica el valor que se
devuelve en lugar de un error cuando se llega al final del
archivo. recursive-p es un parámetro opcional que controla si la
función debe leer de manera recursiva objetos anidados.</li>

<li><b><b>read-line &amp;optional input-stream eof-error-p eof-value
recursive-p</b></b>: Esta función lee una línea de texto desde el flujo
de entrada especificado en input-stream. Devuelve la línea como una
cadena de caracteres (sin el carácter de nueva línea). El segundo
valor que se devuelve es un indicador booleano que es true si el
final del archivo terminó la línea (no está vacía) o false si la
línea se terminó correctamente.</li>

<li><b><b>read-char &amp;optional input-stream eof-error-p eof-value
recursive-p</b></b>: Esta función lee un carácter desde el flujo de
entrada especificado en input-stream. Al igual que las otras
funciones, eof-error-p controla si se produce un error cuando se
alcanza el final del archivo (true por defecto), y eof-value
especifica el valor que se devuelve en lugar de un error cuando se
llega al final del archivo. recursive-p es un parámetro opcional
que controla si la función debe leer de manera recursiva objetos
anidados.</li>
</ul>

<p>
Estas funciones son útiles para leer datos de diferentes maneras desde
flujos de entrada en Lisp.
</p>


<p>
Aquí se describen las funciones unread-char y
read-preserving-whitespace en Lisp:
</p>

<ul class="org-ul">
<li><b><b>unread-char</b></b>: Esta función mueve un carácter al principio del
flujo de entrada. Es importante destacar que el carácter que se
pasa como argumento debe coincidir con el último carácter leído del
flujo de entrada. Después de usar unread-char, cuando se lea el
siguiente carácter del flujo de entrada, será el carácter
especificado seguido de los contenidos previos del flujo de
entrada, ya que el flujo de entrada "retrocede" sobre este
carácter. unread-char devuelve nil como resultado.</li>

<li><b><b>read-preserving-whitespace</b></b>: Esta función se utiliza cuando es
necesario saber con precisión qué carácter finalizó un token
extendido. Permite leer tokens mientras conserva información sobre
los caracteres de espacio en blanco. A diferencia de read, que
normalmente ignora los espacios en blanco,
read-preserving-whitespace conserva los caracteres de espacio en
blanco y proporciona información adicional sobre cómo se formó el
token.</li>
</ul>

<p>
Estas funciones son útiles en situaciones específicas donde se
necesita un mayor control sobre la lectura y manipulación de
caracteres en el flujo de entrada en Lisp.
</p>

<p>
Aquí se describen varias funciones relacionadas con la manipulación de
entrada de caracteres en Lisp:
</p>

<ul class="org-ul">
<li><b><b>peek-char &amp;optional peek-type input-stream eof-error-p eof-value
recursive-p</b></b>: La función peek-char se utiliza para examinar el
siguiente carácter en el flujo de entrada sin eliminarlo del
flujo. El parámetro opcional peek-type determina el comportamiento
de peek-char. Si peek-type es nil (valor predeterminado), la
función devuelve el próximo carácter que se leerá en el flujo de
entrada sin eliminarlo. Esto es útil para ver qué carácter vendrá a
continuación sin avanzar en la secuencia de entrada.</li>

<li><b><b>listen &amp;optional input-stream</b></b>: La función listen se utiliza
para verificar si un carácter está inmediatamente disponible en el
flujo de entrada. Si hay un carácter disponible para ser leído, la
función devuelve true; de lo contrario, devuelve false. Esto es
especialmente útil cuando se trabaja con flujos de entrada
interactivos como el teclado.</li>

<li><b><b>read-char-no-hang &amp;optional input-stream eof-error-p eof-value
recursive-p</b></b>: Similar a read-char, esta función lee un carácter
del flujo de entrada. Sin embargo, si no hay un carácter disponible
de inmediato, en lugar de esperar, devuelve nil de inmediato. Esto
permite una lectura no bloqueante.</li>

<li><b><b>clear-input &amp;optional input-stream</b></b>: La función clear-input se
utiliza para borrar la entrada bufferizada del flujo de entrada
relacionada con la entrada. Es útil, por ejemplo, para eliminar
entradas previas no leídas, especialmente en situaciones de errores
asincrónicos. Si el flujo de entrada no es aplicable para esta
operación, clear-input no tendrá ningún efecto.</li>

<li><b><b>read-from-string string &amp;optional eof-error-p eof-value &amp;key
:start :end :preserve-whitespace:</b></b> Esta función crea un objeto
Lisp a partir de los caracteres de una cadena, uno a la vez, y
devuelve el objeto resultante. Además, devuelve la longitud de la
cadena (o longitud + 1) o el índice del primer carácter en la
cadena que no se leyó.</li>

<li><b><b>parse-integer string &amp;key :start :end :radix :junk-allowed:</b></b> La
función parse-integer se utiliza para analizar una cadena en busca
de un número entero. Puede especificar el rango de caracteres a
considerar mediante los parámetros :start y :end, y puede definir
la base numérica con :radix. Si se encuentra un carácter no válido
y :junk-allowed está configurado en nil, se generará un error.</li>
</ul>

<p>
Estas funciones son útiles en la manipulación de flujos de entrada de
caracteres y en la conversión de cadenas en objetos Lisp o números
enteros.
</p>
</div>
</div>
</div>



<div id="outline-container-org0eb783f" class="outline-3">
<h3 id="org0eb783f">Condicionales en Lisp</h3>
<div class="outline-text-3" id="text-org0eb783f">
<p>
En este documento se describen las condicionales más comunes utilizadas en Lisp, con más ejemplos prácticos para <code>when</code> y <code>unless</code>.
</p>


<ul class="org-ul">
<li><code>if</code> permite evaluar una condición y ejecutar una de dos ramas.</li>
<li><code>when</code> evalúa una condición y ejecuta el bloque de código si es verdadera.</li>
<li><code>unless</code> evalúa una condición y ejecuta el bloque de código si es falsa.</li>
<li><code>cond</code> permite evaluar múltiples condiciones de manera secuencial.</li>
<li><code>case</code> compara una expresión con varios valores posibles y ejecuta el bloque correspondiente.</li>
</ul>
</div>

<div id="outline-container-org4269ebb" class="outline-4">
<h4 id="org4269ebb">Condicionales Básicas</h4>
<div class="outline-text-4" id="text-org4269ebb">
</div>
<ul class="org-ul">
