prolog.org
**** if
La expresión =if= es una de las condicionales más simples en Lisp. Evalúa una condición y ejecuta una de las dos ramas, dependiendo del resultado de esa condición.

#+BEGIN_SRC lisp
(if condición
    entonces
    else)
#+END_SRC

Ejemplo:

#+BEGIN_SRC lisp
(if (> 5 3)
    (print "5 es mayor que 3")
    (print "Esto no se imprimirá"))
#+END_SRC

**** when
La expresión =when= se utiliza cuando solo hay una acción que se desea ejecutar si la condición es verdadera. Si la condición es falsa, no se ejecuta nada.

#+BEGIN_SRC lisp
(when condición
  entonces)
#+END_SRC

Ejemplo básico:

#+BEGIN_SRC lisp
(when (> 5 3)
  (print "5 es mayor que 3"))
#+END_SRC

Esto imprimirá =5 es mayor que 3= porque la condición es verdadera. Si no lo fuera, no haría nada.

***** Ejemplo 2: Ejecutando varias expresiones con =when=
Si quieres ejecutar múltiples expresiones cuando la condición sea verdadera, puedes hacerlo incluyendo más de una expresión dentro de =when=.

#+BEGIN_SRC lisp
(when (= 10 10)
  (print "Diez es igual a diez")
  (print "Este es otro mensaje dentro del when"))
#+END_SRC

Esto imprimirá:

#+BEGIN_EXAMPLE
Diez es igual a diez
Este es otro mensaje dentro del when
#+END_EXAMPLE

***** Ejemplo 3: Usando funciones dentro de =when=
Puedes utilizar cualquier función dentro de =when=. Aquí hay un ejemplo en el que se verifica si una lista no está vacía antes de aplicar una función.

#+BEGIN_SRC lisp
(setq mi-lista '(1 2 3 4))
(when mi-lista
  (print (car mi-lista))  ; Imprime el primer elemento de la lista
  (print (length mi-lista)))  ; Imprime la longitud de la lista
#+END_SRC

La salida será:

#+BEGIN_EXAMPLE
1
4
#+END_EXAMPLE

***** Ejemplo 4: =when= con listas vacías
Lisp trata las listas vacías como =nil=. En este caso, =when= no ejecutará el bloque de código si la lista está vacía.

#+BEGIN_SRC lisp
(setq mi-lista '())
(when mi-lista
  (print "Esto no se imprimirá porque la lista está vacía"))
#+END_SRC

Como la lista está vacía, no se imprimirá nada.

**** unless
La expresión =unless= es lo contrario de =when=. Ejecuta el bloque de código solo si la condición es falsa.

#+BEGIN_SRC lisp
(unless condición
  entonces)
#+END_SRC

Ejemplo básico:

#+BEGIN_SRC lisp
(unless (< 5 3)
  (print "5 no es menor que 3"))
#+END_SRC

Esto imprimirá =5 no es menor que 3= porque la condición es falsa.

***** Ejemplo 2: Ejecutando varias expresiones con =unless=
Al igual que con =when=, también puedes ejecutar múltiples expresiones dentro de =unless=.

#+BEGIN_SRC lisp
(unless nil
  (print "Esto se imprimirá")
  (print "Este es otro mensaje dentro del unless"))
#+END_SRC

Esto imprimirá:

#+BEGIN_EXAMPLE
Esto se imprimirá
Este es otro mensaje dentro del unless
#+END_EXAMPLE

***** Ejemplo 3: =unless= con funciones
Puedes utilizar funciones dentro de =unless= de la misma forma que en =when=.

#+BEGIN_SRC lisp
(setq mi-lista '())
(unless mi-lista
  (print "La lista está vacía")
  (print "No hay elementos en la lista"))
#+END_SRC

Esto imprimirá:

#+BEGIN_EXAMPLE
La lista está vacía
No hay elementos en la lista
#+END_EXAMPLE

***** Ejemplo 4: =unless= con comparaciones
En este ejemplo, se compara si dos valores no son iguales, y si es cierto, ejecuta el bloque de código.

#+BEGIN_SRC lisp
(setq x 10)
(unless (= x 5)
  (print "x no es igual a 5")
  (print "El valor de x es" x))
#+END_SRC

La salida será:

#+BEGIN_EXAMPLE
x no es igual a 5
El valor de x es 10
#+END_EXAMPLE

*** Condicionales Anidadas
Las condicionales =when= y =unless= también pueden anidarse dentro de otras condicionales.

Ejemplo:

#+BEGIN_SRC lisp
(if (= 5 5)
    (when (> 5 3)
      (print "Ambas condiciones son verdaderas"))
    (unless (> 5 3)
      (print "Esto no se imprimirá")))
#+END_SRC

Aquí se imprime =Ambas condiciones son verdaderas=, ya que ambas condiciones dentro de la condicional son ciertas.

*** Condicionales Complejas
