index.html
<li><a id="org039efa7"></a>if<br />
<div class="outline-text-5" id="text-org039efa7">
<p>
La expresión <code>if</code> es una de las condicionales más simples en Lisp. Evalúa una condición y ejecuta una de las dos ramas, dependiendo del resultado de esa condición.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">if</span> condici&#243;n
    entonces
    else<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>&gt; 5 3<span style="color: #ff995e;">)</span>
    <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"5 es mayor que 3"</span><span style="color: #ff995e;">)</span>
    <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Esto no se imprimir&#225;"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org20c4fe9"></a>when<br />
<div class="outline-text-5" id="text-org20c4fe9">
<p>
La expresión <code>when</code> se utiliza cuando solo hay una acción que se desea ejecutar si la condición es verdadera. Si la condición es falsa, no se ejecuta nada.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">when</span> condici&#243;n
  entonces<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Ejemplo básico:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">when</span> <span style="color: #ff995e;">(</span>&gt; 5 3<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"5 es mayor que 3"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto imprimirá <code>5 es mayor que 3</code> porque la condición es verdadera. Si no lo fuera, no haría nada.
</p>
</div>

<ul class="org-ul">
<li><a id="orga3283f9"></a>Ejemplo 2: Ejecutando varias expresiones con <code>when</code><br />
<div class="outline-text-6" id="text-orga3283f9">
<p>
Si quieres ejecutar múltiples expresiones cuando la condición sea verdadera, puedes hacerlo incluyendo más de una expresión dentro de <code>when</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">when</span> <span style="color: #ff995e;">(</span>= 10 10<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Diez es igual a diez"</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Este es otro mensaje dentro del when"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto imprimirá:
</p>

<pre class="example" id="org7338132">
Diez es igual a diez
Este es otro mensaje dentro del when
</pre>
</div>
</li>

<li><a id="org30b34ba"></a>Ejemplo 3: Usando funciones dentro de <code>when</code><br />
<div class="outline-text-6" id="text-org30b34ba">
<p>
Puedes utilizar cualquier función dentro de <code>when</code>. Aquí hay un ejemplo en el que se verifica si una lista no está vacía antes de aplicar una función.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq mi-lista '<span style="color: #ff995e;">(</span>1 2 3 4<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span><span style="color: #c099ff;">when</span> mi-lista
  <span style="color: #ff995e;">(</span>print <span style="color: #ff98a4;">(</span>car mi-lista<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>  <span style="color: #7a88cf;">; Imprime el primer elemento de la lista</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #ff98a4;">(</span>length mi-lista<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">; Imprime la longitud de la lista</span>
</pre>
</div>

<p>
La salida será:
</p>

<pre class="example" id="orge61b491">
1
4
</pre>
</div>
</li>

<li><a id="orgdb3edc8"></a>Ejemplo 4: <code>when</code> con listas vacías<br />
<div class="outline-text-6" id="text-orgdb3edc8">
<p>
Lisp trata las listas vacías como <code>nil</code>. En este caso, <code>when</code> no ejecutará el bloque de código si la lista está vacía.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq mi-lista '<span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span><span style="color: #c099ff;">when</span> mi-lista
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Esto no se imprimir&#225; porque la lista est&#225; vac&#237;a"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Como la lista está vacía, no se imprimirá nada.
</p>
</div>
</li>
</ul>
</li>

<li><a id="orgb546d1a"></a>unless<br />
<div class="outline-text-5" id="text-orgb546d1a">
<p>
La expresión <code>unless</code> es lo contrario de <code>when</code>. Ejecuta el bloque de código solo si la condición es falsa.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">unless</span> condici&#243;n
  entonces<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Ejemplo básico:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">unless</span> <span style="color: #ff995e;">(</span>&lt; 5 3<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"5 no es menor que 3"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto imprimirá <code>5 no es menor que 3</code> porque la condición es falsa.
</p>
</div>

<ul class="org-ul">
<li><a id="org4adf91c"></a>Ejemplo 2: Ejecutando varias expresiones con <code>unless</code><br />
<div class="outline-text-6" id="text-org4adf91c">
<p>
Al igual que con <code>when</code>, también puedes ejecutar múltiples expresiones dentro de <code>unless</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">unless</span> nil
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Esto se imprimir&#225;"</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"Este es otro mensaje dentro del unless"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto imprimirá:
</p>

<pre class="example" id="orgea6607c">
Esto se imprimirá
Este es otro mensaje dentro del unless
</pre>
</div>
</li>

<li><a id="org4698f03"></a>Ejemplo 3: <code>unless</code> con funciones<br />
<div class="outline-text-6" id="text-org4698f03">
<p>
Puedes utilizar funciones dentro de <code>unless</code> de la misma forma que en <code>when</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq mi-lista '<span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span><span style="color: #c099ff;">unless</span> mi-lista
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"La lista est&#225; vac&#237;a"</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"No hay elementos en la lista"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto imprimirá:
</p>

<pre class="example" id="orgc36bfe4">
La lista está vacía
No hay elementos en la lista
</pre>
</div>
</li>

<li><a id="orgd75ef77"></a>Ejemplo 4: <code>unless</code> con comparaciones<br />
<div class="outline-text-6" id="text-orgd75ef77">
<p>
En este ejemplo, se compara si dos valores no son iguales, y si es cierto, ejecuta el bloque de código.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq x 10<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span><span style="color: #c099ff;">unless</span> <span style="color: #ff995e;">(</span>= x 5<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"x no es igual a 5"</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>print <span style="color: #c3e88d;">"El valor de x es"</span> x<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
La salida será:
</p>

<pre class="example" id="orga7238b6">
x no es igual a 5
El valor de x es 10
</pre>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org2751723" class="outline-4">
<h4 id="org2751723">Condicionales Anidadas</h4>
<div class="outline-text-4" id="text-org2751723">
<p>
Las condicionales <code>when</code> y <code>unless</code> también pueden anidarse dentro de otras condicionales.
</p>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>= 5 5<span style="color: #ff995e;">)</span>
    <span style="color: #ff995e;">(</span><span style="color: #c099ff;">when</span> <span style="color: #ff98a4;">(</span>&gt; 5 3<span style="color: #ff98a4;">)</span>
      <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"Ambas condiciones son verdaderas"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
    <span style="color: #ff995e;">(</span><span style="color: #c099ff;">unless</span> <span style="color: #ff98a4;">(</span>&gt; 5 3<span style="color: #ff98a4;">)</span>
      <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"Esto no se imprimir&#225;"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Aquí se imprime <code>Ambas condiciones son verdaderas</code>, ya que ambas condiciones dentro de la condicional son ciertas.
</p>
</div>
</div>

<div id="outline-container-orgf57badc" class="outline-4">
<h4 id="orgf57badc">Condicionales Complejas</h4>
<div class="outline-text-4" id="text-orgf57badc">
</div>
<ul class="org-ul">
