prolog.org
**** cond
La expresión =cond= se utiliza para evaluar múltiples condiciones. Se puede pensar en =cond= como una cadena de =if=, cada uno con su propia condición y acción.

#+BEGIN_SRC lisp
(cond
  (condición1 acción1)
  (condición2 acción2)
  (t acción-por-defecto))
#+END_SRC

Ejemplo:

#+BEGIN_SRC lisp
(cond
  ((= 5 6) (print "5 es igual a 6"))
  ((> 5 6) (print "5 es mayor que 6"))
  (t (print "Ninguna de las anteriores")))
#+END_SRC

Se imprimirá =Ninguna de las anteriores= porque ambas condiciones anteriores son falsas.

**** case
La expresión =case= es similar a un "switch" en otros lenguajes de programación. Se utiliza para evaluar una expresión y compararla con una lista de posibles valores.

#+BEGIN_SRC lisp
(case expresión
  (valor1 acción1)
  (valor2 acción2)
  (t acción-por-defecto))
#+END_SRC

Ejemplo:

#+BEGIN_SRC lisp
(case 5
  (1 (print "Uno"))
  (5 (print "Cinco"))
  (t (print "Ninguno de los anteriores")))
#+END_SRC

Aquí se imprimirá =Cinco= porque la expresión evaluada es igual a 5.

*** Referencias
Para más información sobre las condicionales en Lisp, se recomienda revisar la documentación oficial o los siguientes recursos:
- [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Conditionals.html][GNU Emacs Lisp Reference Manual - Condicionales]]




**  Listas de Asociación en Lisp
Las **listas de asociación** en **Lisp** permiten asociar claves con
valores. Cada clave está emparejada con un valor en una lista. A
continuación, te muestro cómo crear, modificar, y acceder a estas
listas.

**Concepto de listas de asociación**

Una **lista de asociación** es una lista donde cada elemento es un par clave-valor, representado por una lista de dos elementos. Por ejemplo:

#+BEGIN_SRC lisp
(setq mi-alist '((nombre . "Juan")
                 (edad . 30)
                 (ciudad . "Madrid")))
#+END_SRC

Esta lista tiene:
- `nombre` asociado a `"Juan"`
- `edad` asociado a `30`
- `ciudad` asociado a `"Madrid"`

**Operaciones básicas**

*** 1. Acceder a un valor ***
Para obtener el valor asociado a una clave, se utiliza la función `assoc`:

#+BEGIN_SRC lisp
(assoc 'nombre mi-alist)
#+END_SRC

Esto devolverá el par `(nombre . "Juan")`. Para obtener solo el valor, usa `cdr`:

#+BEGIN_SRC lisp
(cdr (assoc 'nombre mi-alist))
#+END_SRC

Resultado: `"Juan"`

*** 2. Agregar un nuevo par clave-valor ***
Puedes agregar un nuevo par clave-valor al principio de la lista con `cons`:

#+BEGIN_SRC lisp
(setq mi-alist (cons '(pais . "España") mi-alist))
#+END_SRC

Ahora `mi-alist` incluirá `(pais . "España")`.

*** 3. Modificar un valor existente ***
Para modificar el valor de una clave existente, primero eliminas el par antiguo y luego agregas el nuevo:

#+BEGIN_SRC lisp
(setq mi-alist (cons '(edad . 31) (assq-delete-all 'edad mi-alist)))
#+END_SRC

Esto actualiza el valor de `edad` a `31`.

*** 4. Eliminar un par clave-valor ***
Para eliminar un par clave-valor por su clave, usa `assq-delete-all`:

#+BEGIN_SRC lisp
(setq mi-alist (assq-delete-all 'ciudad mi-alist))
#+END_SRC

Esto elimina el par `(ciudad . "Madrid")` de la lista.

**Ejemplo completo**


#+BEGIN_SRC lisp
;; Definir una lista de asociación
(setq mi-alist '((nombre . "Juan")
                 (edad . 30)y
                 (ciudad . "Madrid")))

;; Acceder a un valor
(format t "Nombre: ~a~%" (cdr (assoc 'nombre mi-alist)))

;; Agregar un nuevo par
(setq mi-alist (cons '(pais . "España") mi-alist))

;; Modificar un valor existente
(setq mi-alist (cons '(edad . 31) (assq-delete-all 'edad mi-alist)))

;; Eliminar un par
(setq mi-alist (assq-delete-all 'ciudad mi-alist))

;; Imprimir la lista completa
(format t "Lista de asociación: ~a~%" mi-alist)
#+END_SRC


** Casi-Quoting en Lisp

*** Introducción
El **casi-quoting** (*backquote*) es una herramienta poderosa en Lisp
para crear listas que contienen tanto valores literales como valores
evaluados. A diferencia de `quote`, que previene la evaluación
completa de una lista, el **backquote** te permite evaluar partes
específicas de la lista usando comas (`,`).

