index.html
<li><a id="org578f835"></a>cond<br />
<div class="outline-text-5" id="text-org578f835">
<p>
La expresión <code>cond</code> se utiliza para evaluar múltiples condiciones. Se puede pensar en <code>cond</code> como una cadena de <code>if</code>, cada uno con su propia condición y acción.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">cond</span>
  <span style="color: #ff995e;">(</span>condici&#243;n1 acci&#243;n1<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>condici&#243;n2 acci&#243;n2<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>t acci&#243;n-por-defecto<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">cond</span>
  <span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span>= 5 6<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"5 es igual a 6"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span>&gt; 5 6<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"5 es mayor que 6"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>t <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"Ninguna de las anteriores"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Se imprimirá <code>Ninguna de las anteriores</code> porque ambas condiciones anteriores son falsas.
</p>
</div>
</li>

<li><a id="org907a6c7"></a>case<br />
<div class="outline-text-5" id="text-org907a6c7">
<p>
La expresión <code>case</code> es similar a un "switch" en otros lenguajes de programación. Se utiliza para evaluar una expresión y compararla con una lista de posibles valores.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">case</span> expresi&#243;n
  <span style="color: #ff995e;">(</span>valor1 acci&#243;n1<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>valor2 acci&#243;n2<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>t acci&#243;n-por-defecto<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">case</span> 5
  <span style="color: #ff995e;">(</span>1 <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"Uno"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>5 <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"Cinco"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>t <span style="color: #ff98a4;">(</span>print <span style="color: #c3e88d;">"Ninguno de los anteriores"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Aquí se imprimirá <code>Cinco</code> porque la expresión evaluada es igual a 5.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgf6465bc" class="outline-4">
<h4 id="orgf6465bc">Referencias</h4>
<div class="outline-text-4" id="text-orgf6465bc">
<p>
Para más información sobre las condicionales en Lisp, se recomienda revisar la documentación oficial o los siguientes recursos:
</p>
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Conditionals.html">GNU Emacs Lisp Reference Manual - Condicionales</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org4ad9867" class="outline-3">
<h3 id="org4ad9867">Listas de Asociación en Lisp</h3>
<div class="outline-text-3" id="text-org4ad9867">
<p>
Las <b><b>listas de asociación</b></b> en <b><b>Lisp</b></b> permiten asociar claves con
valores. Cada clave está emparejada con un valor en una lista. A
continuación, te muestro cómo crear, modificar, y acceder a estas
listas.
</p>

<p>
<b><b>Concepto de listas de asociación</b></b>
</p>

<p>
Una <b><b>lista de asociación</b></b> es una lista donde cada elemento es un par clave-valor, representado por una lista de dos elementos. Por ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq mi-alist '<span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span>nombre . <span style="color: #c3e88d;">"Juan"</span><span style="color: #ff98a4;">)</span>
                 <span style="color: #ff98a4;">(</span>edad . 30<span style="color: #ff98a4;">)</span>
                 <span style="color: #ff98a4;">(</span>ciudad . <span style="color: #c3e88d;">"Madrid"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esta lista tiene:
</p>
<ul class="org-ul">
<li>`nombre` asociado a `"Juan"`</li>
<li>`edad` asociado a `30`</li>
<li>`ciudad` asociado a `"Madrid"`</li>
</ul>

<p>
<b><b>Operaciones básicas</b></b>
</p>
</div>

<div id="outline-container-org484675a" class="outline-4">
<h4 id="org484675a">1. Acceder a un valor <b>*</b></h4>
<div class="outline-text-4" id="text-org484675a">
<p>
Para obtener el valor asociado a una clave, se utiliza la función `assoc`:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>assoc 'nombre mi-alist<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto devolverá el par `(nombre . "Juan")`. Para obtener solo el valor, usa `cdr`:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>cdr <span style="color: #ff995e;">(</span>assoc 'nombre mi-alist<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado: `"Juan"`
</p>
</div>
</div>

<div id="outline-container-org7c8bb12" class="outline-4">
<h4 id="org7c8bb12">2. Agregar un nuevo par clave-valor <b>*</b></h4>
<div class="outline-text-4" id="text-org7c8bb12">
<p>
Puedes agregar un nuevo par clave-valor al principio de la lista con `cons`:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq mi-alist <span style="color: #ff995e;">(</span>cons '<span style="color: #ff98a4;">(</span>pais . <span style="color: #c3e88d;">"Espa&#241;a"</span><span style="color: #ff98a4;">)</span> mi-alist<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Ahora `mi-alist` incluirá `(pais . "España")`.
</p>
</div>
</div>

<div id="outline-container-org553e290" class="outline-4">
<h4 id="org553e290">3. Modificar un valor existente <b>*</b></h4>
<div class="outline-text-4" id="text-org553e290">
<p>
Para modificar el valor de una clave existente, primero eliminas el par antiguo y luego agregas el nuevo:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq mi-alist <span style="color: #ff995e;">(</span>cons '<span style="color: #ff98a4;">(</span>edad . 31<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>assq-delete-all 'edad mi-alist<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto actualiza el valor de `edad` a `31`.
</p>
</div>
</div>

<div id="outline-container-org19de8ae" class="outline-4">
<h4 id="org19de8ae">4. Eliminar un par clave-valor <b>*</b></h4>
<div class="outline-text-4" id="text-org19de8ae">
<p>
Para eliminar un par clave-valor por su clave, usa `assq-delete-all`:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq mi-alist <span style="color: #ff995e;">(</span>assq-delete-all 'ciudad mi-alist<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esto elimina el par `(ciudad . "Madrid")` de la lista.
</p>

<p>
<b><b>Ejemplo completo</b></b>
</p>


<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Definir una lista de asociaci&#243;n</span>
<span style="color: #c099ff;">(</span>setq mi-alist '<span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span>nombre . <span style="color: #c3e88d;">"Juan"</span><span style="color: #ff98a4;">)</span>
                 <span style="color: #ff98a4;">(</span>edad . 30<span style="color: #ff98a4;">)</span>y
                 <span style="color: #ff98a4;">(</span>ciudad . <span style="color: #c3e88d;">"Madrid"</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Acceder a un valor</span>
<span style="color: #c099ff;">(</span>format t <span style="color: #c3e88d;">"Nombre: ~a~%"</span> <span style="color: #ff995e;">(</span>cdr <span style="color: #ff98a4;">(</span>assoc 'nombre mi-alist<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Agregar un nuevo par</span>
<span style="color: #c099ff;">(</span>setq mi-alist <span style="color: #ff995e;">(</span>cons '<span style="color: #ff98a4;">(</span>pais . <span style="color: #c3e88d;">"Espa&#241;a"</span><span style="color: #ff98a4;">)</span> mi-alist<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Modificar un valor existente</span>
<span style="color: #c099ff;">(</span>setq mi-alist <span style="color: #ff995e;">(</span>cons '<span style="color: #ff98a4;">(</span>edad . 31<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>assq-delete-all 'edad mi-alist<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Eliminar un par</span>
<span style="color: #c099ff;">(</span>setq mi-alist <span style="color: #ff995e;">(</span>assq-delete-all 'ciudad mi-alist<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Imprimir la lista completa</span>
<span style="color: #c099ff;">(</span>format t <span style="color: #c3e88d;">"Lista de asociaci&#243;n: ~a~%"</span> mi-alist<span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org7107b7d" class="outline-3">
<h3 id="org7107b7d">Casi-Quoting en Lisp</h3>
<div class="outline-text-3" id="text-org7107b7d">
</div>
<div id="outline-container-orgc32c51e" class="outline-4">
<h4 id="orgc32c51e">Introducción</h4>
<div class="outline-text-4" id="text-orgc32c51e">
<p>
El <b><b>casi-quoting</b></b> (<b>backquote</b>) es una herramienta poderosa en Lisp
para crear listas que contienen tanto valores literales como valores
evaluados. A diferencia de `quote`, que previene la evaluación
completa de una lista, el <b><b>backquote</b></b> te permite evaluar partes
específicas de la lista usando comas (`,`).
</p>
</div>
</div>
