prolog.org
*** 1. Operador `quote`
El operador `quote` (`'`) en Lisp previene la evaluación de una expresión. Si citas una lista, ésta se trata como literal:

#+BEGIN_SRC lisp
'(a b c)
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(a b c)
#+END_EXAMPLE

*** 2. Operador `backquote`
El **backquote** (o *casi-quoting*) es similar a `quote`, pero permite que algunas partes de la lista sean evaluadas. El operador es el símbolo de acento grave (**`**):

#+BEGIN_SRC lisp
`(a b c)
#+END_SRC

Este código produce el mismo resultado que `quote`, es decir:

#+BEGIN_EXAMPLE
(a b c)
#+END_EXAMPLE

La ventaja del `backquote` es que puedes usar comas (`,`) para evaluar partes específicas de la lista.

*** 3. Evaluación con la coma (`,`)
Dentro de una lista creada con *backquote*, cualquier parte de la lista precedida por una coma (`,`) se evalúa, mientras que el resto permanece literal.

#+BEGIN_SRC lisp
(setq x 10)
`(a b ,x)
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(a b 10)
#+END_EXAMPLE

Aquí, la variable `x` se evaluó y su valor, `10`, se insertó en la lista.

*** 4. Expansión de listas con `,@`
Cuando necesitas insertar los elementos de una lista en lugar de la lista completa como un elemento único, puedes usar `,@` (coma seguido de arroba). Esto "expande" la lista y la inserta en la lista resultante.

#+BEGIN_SRC lisp
(setq lst '(1 2 3))
`(a b ,@lst)
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(a b 1 2 3)
#+END_EXAMPLE

En este caso, los elementos de `lst` se expanden e insertan en la lista final.

*** 5. Combinación de `backquote`, `,` y `,@`
Puedes combinar `backquote`, `,` y `,@` para crear listas más complejas que mezclan datos literales y resultados evaluados.

#+BEGIN_SRC lisp
(setq x 10)
(setq lst '(1 2 3))
`(valores: ,x lista: ,@lst)
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(valores: 10 lista: 1 2 3)
#+END_EXAMPLE

En este ejemplo:
- `,x` inserta el valor de `x`.
- `,@lst` expande los elementos de `lst`.

*** 6. Ejemplos adicionales

**** Ejemplo 1: Combinando literales y evaluaciones
#+BEGIN_SRC lisp
(setq a 5)
(setq b 10)
`(suma ,(+ a b) lista (1 2 ,(+ 3 4)))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(suma 15 lista (1 2 7))
#+END_EXAMPLE

**** Ejemplo 2: Insertando múltiples listas
#+BEGIN_SRC lisp
(setq l1 '(a b c))
(setq l2 '(x y z))
`(primera lista: ,@l1 segunda lista: ,@l2)
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(primera lista: a b c segunda lista: x y z)
#+END_EXAMPLE


*** 8. Ejemplo completo

#+BEGIN_SRC lisp
(setq x 20)
(setq nums '(1 2 3))
(setq palabra "hola")

`(el valor de x es ,x y la lista es ,@nums, con una palabra ,palabra)
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(el valor de x es 20 y la lista es 1 2 3 con una palabra hola)
#+END_EXAMPLE


- **`quote`** (`'`): Cita una lista, evitando su evaluación.
- **`backquote`** (**`**): Crea una lista que puede tener partes evaluadas.
- **`,`**: Evalúa una expresión dentro de una lista con *backquote*.
- **`,@`**: Expande el contenido de una lista dentro de otra lista.

** mapcar en Lisp

*** Introducción
La función `mapcar` en Lisp se utiliza para aplicar una función a cada
elemento de una o más listas, devolviendo una nueva lista con los
resultados de esas aplicaciones. Es una de las funciones más útiles
para procesar listas en Lisp, ya que permite transformar listas de
manera sencilla.

*** Sintaxis básica de mapcar
La sintaxis básica de mapcar es la siguiente:

#+BEGIN_SRC lisp
(mapcar función lista)
#+END_SRC

- **función**: Es una función que se aplicará a cada elemento de la lista.
- **lista**: Es la lista a la que se aplicará la función.

*** Ejemplos básicos

**** Ejemplo 1: Aplicando una función a una lista
Vamos a aplicar la función 1+ (que suma 1) a cada elemento de una lista de números:

#+BEGIN_SRC lisp
(mapcar #'1+ '(1 2 3 4 5))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(2 3 4 5 6)
#+END_EXAMPLE

Aquí, `mapcar` ha aplicado la función 1+ a cada número en la lista, incrementando cada uno en 1.

**** Ejemplo 2: Usando una función lambda
También puedes usar funciones anónimas (lambda) con `mapcar`. En este ejemplo, multiplicamos cada número de una lista por 2:

#+BEGIN_SRC lisp
(mapcar (lambda (x) (* x 2)) '(1 2 3 4 5))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(2 4 6 8 10)
#+END_EXAMPLE

**** Ejemplo 3: Aplicando una función a varias listas
`mapcar` también puede operar sobre varias listas. La función debe tomar tantos argumentos como listas haya:

#+BEGIN_SRC lisp
(mapcar #'+ '(1 2 3) '(4 5 6))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(5 7 9)
#+END_EXAMPLE

Aquí, `mapcar` ha sumado los elementos correspondientes de las dos listas.

*** Ejemplos 

