index.html

<div id="outline-container-orgdf1570b" class="outline-4">
<h4 id="orgdf1570b">1. Operador `quote`</h4>
<div class="outline-text-4" id="text-orgdf1570b">
<p>
El operador `quote` (`'`) en Lisp previene la evaluación de una expresión. Si citas una lista, ésta se trata como literal:
</p>

<div class="org-src-container">
<pre class="src src-lisp">'<span style="color: #c099ff;">(</span>a b c<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="orgd855ec6">
(a b c)
</pre>
</div>
</div>

<div id="outline-container-orgd68aa28" class="outline-4">
<h4 id="orgd68aa28">2. Operador `backquote`</h4>
<div class="outline-text-4" id="text-orgd68aa28">
<p>
El <b><b>backquote</b></b> (o <b>casi-quoting</b>) es similar a `quote`, pero permite que algunas partes de la lista sean evaluadas. El operador es el símbolo de acento grave (<b><b>`</b></b>):
</p>

<div class="org-src-container">
<pre class="src src-lisp">`<span style="color: #c099ff;">(</span>a b c<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Este código produce el mismo resultado que `quote`, es decir:
</p>

<pre class="example" id="orge5761af">
(a b c)
</pre>

<p>
La ventaja del `backquote` es que puedes usar comas (`,`) para evaluar partes específicas de la lista.
</p>
</div>
</div>

<div id="outline-container-org20a4361" class="outline-4">
<h4 id="org20a4361">3. Evaluación con la coma (`,`)</h4>
<div class="outline-text-4" id="text-org20a4361">
<p>
Dentro de una lista creada con <b>backquote</b>, cualquier parte de la lista precedida por una coma (`,`) se evalúa, mientras que el resto permanece literal.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq x 10<span style="color: #c099ff;">)</span>
`<span style="color: #c099ff;">(</span>a b ,x<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org8b5065e">
(a b 10)
</pre>

<p>
Aquí, la variable `x` se evaluó y su valor, `10`, se insertó en la lista.
</p>
</div>
</div>

<div id="outline-container-orge618cf9" class="outline-4">
<h4 id="orge618cf9">4. Expansión de listas con `,@`</h4>
<div class="outline-text-4" id="text-orge618cf9">
<p>
Cuando necesitas insertar los elementos de una lista en lugar de la lista completa como un elemento único, puedes usar `,@` (coma seguido de arroba). Esto "expande" la lista y la inserta en la lista resultante.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq lst '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
`<span style="color: #c099ff;">(</span>a b ,@lst<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org0f633be">
(a b 1 2 3)
</pre>

<p>
En este caso, los elementos de `lst` se expanden e insertan en la lista final.
</p>
</div>
</div>

<div id="outline-container-orgfc43ad1" class="outline-4">
<h4 id="orgfc43ad1">5. Combinación de `backquote`, `,` y `,@`</h4>
<div class="outline-text-4" id="text-orgfc43ad1">
<p>
Puedes combinar `backquote`, `,` y `,@` para crear listas más complejas que mezclan datos literales y resultados evaluados.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq x 10<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>setq lst '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
`<span style="color: #c099ff;">(</span>valores: ,x lista: ,@lst<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org49ded7b">
(valores: 10 lista: 1 2 3)
</pre>

<p>
En este ejemplo:
</p>
<ul class="org-ul">
<li>`,x` inserta el valor de `x`.</li>
<li>`,@lst` expande los elementos de `lst`.</li>
</ul>
</div>
</div>

<div id="outline-container-org0332790" class="outline-4">
<h4 id="org0332790">6. Ejemplos adicionales</h4>
<div class="outline-text-4" id="text-org0332790">
</div>
<ul class="org-ul">
<li><a id="org3d741d0"></a>Ejemplo 1: Combinando literales y evaluaciones<br />
<div class="outline-text-5" id="text-org3d741d0">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq a 5<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>setq b 10<span style="color: #c099ff;">)</span>
`<span style="color: #c099ff;">(</span>suma ,<span style="color: #ff995e;">(</span>+ a b<span style="color: #ff995e;">)</span> lista <span style="color: #ff995e;">(</span>1 2 ,<span style="color: #ff98a4;">(</span>+ 3 4<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org955e53a">
(suma 15 lista (1 2 7))
</pre>
</div>
</li>

<li><a id="org72e9088"></a>Ejemplo 2: Insertando múltiples listas<br />
<div class="outline-text-5" id="text-org72e9088">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq l1 '<span style="color: #ff995e;">(</span>a b c<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>setq l2 '<span style="color: #ff995e;">(</span>x y z<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
`<span style="color: #c099ff;">(</span>primera lista: ,@l1 segunda lista: ,@l2<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org19c50c8">
(primera lista: a b c segunda lista: x y z)
</pre>
</div>
</li>
</ul>
</div>


<div id="outline-container-orga4da171" class="outline-4">
<h4 id="orga4da171">8. Ejemplo completo</h4>
<div class="outline-text-4" id="text-orga4da171">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>setq x 20<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>setq nums '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>setq palabra <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>

`<span style="color: #c099ff;">(</span>el valor de x es ,x y la lista es ,@nums, con una palabra ,palabra<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org0430844">
(el valor de x es 20 y la lista es 1 2 3 con una palabra hola)
</pre>


<ul class="org-ul">
<li><b><b>`quote`</b></b> (`'`): Cita una lista, evitando su evaluación.</li>
<li><b><b>`backquote`</b></b> (<b><b>`</b></b>): Crea una lista que puede tener partes evaluadas.</li>
<li><b><b>`,`</b></b>: Evalúa una expresión dentro de una lista con <b>backquote</b>.</li>
<li><b><b>`,@`</b></b>: Expande el contenido de una lista dentro de otra lista.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7e7c77d" class="outline-3">
<h3 id="org7e7c77d">mapcar en Lisp</h3>
<div class="outline-text-3" id="text-org7e7c77d">
</div>
<div id="outline-container-org37f7110" class="outline-4">
<h4 id="org37f7110">Introducción</h4>
<div class="outline-text-4" id="text-org37f7110">
<p>
La función `mapcar` en Lisp se utiliza para aplicar una función a cada
elemento de una o más listas, devolviendo una nueva lista con los
resultados de esas aplicaciones. Es una de las funciones más útiles
para procesar listas en Lisp, ya que permite transformar listas de
manera sencilla.
</p>
</div>
</div>

<div id="outline-container-org80e7c63" class="outline-4">
<h4 id="org80e7c63">Sintaxis básica de mapcar</h4>
<div class="outline-text-4" id="text-org80e7c63">
<p>
La sintaxis básica de mapcar es la siguiente:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar funci&#243;n lista<span style="color: #c099ff;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>función</b></b>: Es una función que se aplicará a cada elemento de la lista.</li>
<li><b><b>lista</b></b>: Es la lista a la que se aplicará la función.</li>
</ul>
</div>
</div>

<div id="outline-container-org5928267" class="outline-4">
<h4 id="org5928267">Ejemplos básicos</h4>
<div class="outline-text-4" id="text-org5928267">
</div>
<ul class="org-ul">
<li><a id="org10a846a"></a>Ejemplo 1: Aplicando una función a una lista<br />
<div class="outline-text-5" id="text-org10a846a">
<p>
Vamos a aplicar la función 1+ (que suma 1) a cada elemento de una lista de números:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar #'1+ '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org6c3e6c1">
(2 3 4 5 6)
</pre>

<p>
Aquí, `mapcar` ha aplicado la función 1+ a cada número en la lista, incrementando cada uno en 1.
</p>
</div>
</li>

<li><a id="org8113a8e"></a>Ejemplo 2: Usando una función lambda<br />
<div class="outline-text-5" id="text-org8113a8e">
<p>
También puedes usar funciones anónimas (lambda) con `mapcar`. En este ejemplo, multiplicamos cada número de una lista por 2:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>* x 2<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="orgf5812ee">
(2 4 6 8 10)
</pre>
</div>
</li>

<li><a id="org96fd5ad"></a>Ejemplo 3: Aplicando una función a varias listas<br />
<div class="outline-text-5" id="text-org96fd5ad">
<p>
`mapcar` también puede operar sobre varias listas. La función debe tomar tantos argumentos como listas haya:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar #'+ '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>4 5 6<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org464be11">
(5 7 9)
</pre>

<p>
Aquí, `mapcar` ha sumado los elementos correspondientes de las dos listas.
</p>
</div>
</li>
</ul>
</div>
