prolog.org
**** Ejemplo 4: Filtrando listas con `mapcar`
Aunque `mapcar` no está diseñado específicamente para filtrar listas,
podemos usarlo junto con una función condicional para obtener un
efecto de filtrado. Por ejemplo, si queremos obtener solo los números
pares de una lista, podríamos hacer lo siguiente:

#+BEGIN_SRC lisp
(mapcar (lambda (x) (if (evenp x) x nil)) '(1 2 3 4 5 6))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(nil 2 nil 4 nil 6)
#+END_EXAMPLE

Esto devolverá `nil` para los números impares y los números pares sin cambios.

**** Ejemplo 5: Transformando listas de listas
`mapcar` también es útil para trabajar con listas de listas. Por ejemplo, si queremos sumar los elementos de sublistas:

#+BEGIN_SRC lisp
(mapcar (lambda (lst) (apply #'+ lst)) '((1 2 3) (4 5 6) (7 8 9)))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(6 15 24)
#+END_EXAMPLE

Aquí, hemos sumado los elementos de cada sublista.

**** Ejemplo 6: Trabajando con cadenas de texto
`mapcar` no está limitado solo a números. También puede aplicarse a listas de caracteres o cadenas de texto:

#+BEGIN_SRC lisp
(mapcar #'char-upcase '("a" "b" "c" "d"))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
("A" "B" "C" "D")
#+END_EXAMPLE

Este ejemplo convierte cada letra en mayúscula.

- `mapcar` es una función poderosa en Lisp para aplicar una función a cada elemento de una o más listas.
- Puedes usar funciones predefinidas, como `1+` o `+`, o funciones anónimas (lambda).
- Se puede aplicar a listas de números, cadenas de texto, o incluso listas de listas.


#+BEGIN_SRC lisp
;; Definimos una lista de números
(setq numeros '(1 2 3 4 5 6 7 8 9 10))

;; Usamos mapcar para obtener los números pares multiplicados por 2
(mapcar (lambda (x) (if (evenp x) (* x 2) nil)) numeros)

;; Aplicamos mapcar para sumar los elementos de dos listas
(mapcar #'+ '(1 2 3) '(4 5 6))

;; Aplicamos mapcar para convertir letras minúsculas a mayúsculas
(mapcar #'char-upcase '("a" "b" "c" "d"))
#+END_SRC


** Manual de Comparaciones en Lisp

En **Lisp**, las funciones de comparación se utilizan para comparar
diferentes tipos de objetos: números, cadenas, símbolos, listas,
etc. Dependiendo del tipo de dato que estés comparando, es importante
usar la función adecuada.

*** 1. *eq*
La función *eq* es la forma más básica de comparación en Lisp. Compara si dos objetos son **idénticos** (el mismo objeto en memoria). Generalmente se usa para comparar símbolos.

#+BEGIN_SRC lisp
(eq 'a 'a)  ;; Devuelve T, porque los símbolos son el mismo objeto
(eq 'a 'b)  ;; Devuelve NIL, los símbolos son diferentes
(eq 10 10)  ;; En algunas implementaciones puede devolver NIL
(eq "hola" "hola")  ;; Devuelve NIL, las cadenas no son el mismo objeto en memoria
#+END_SRC

- **Mejor uso**: Comparación de símbolos.
- **Advertencia**: No usar para comparar números o cadenas de texto, ya que puede devolver resultados inesperados.

*** 2. *eql*
*eql* es más general que *eq*. Se comporta igual que *eq* para símbolos, pero también maneja correctamente la comparación de números y caracteres.

#+BEGIN_SRC lisp
(eql 'a 'a)  ;; Devuelve T
(eql 10 10)  ;; Devuelve T, porque compara números por su valor
(eql 10.0 10)  ;; Devuelve NIL, porque compara tipos también (entero vs flotante)
(eql #\A #\A)  ;; Devuelve T, compara caracteres
(eql "hola" "hola")  ;; Devuelve NIL, porque compara referencias de cadenas
#+END_SRC

- **Mejor uso**: Comparación de símbolos, números, y caracteres.

*** 3. *equal*
*equal* compara el contenido de dos objetos de forma más flexible. Es capaz de comparar listas, números, símbolos, y cadenas de texto, pero no distingue entre mayúsculas y minúsculas en cadenas.

#+BEGIN_SRC lisp
(equal '(1 2 3) '(1 2 3))  ;; Devuelve T, compara listas por contenido
(equal "hola" "hola")  ;; Devuelve T, compara cadenas por su contenido
(equal "Hola" "hola")  ;; Devuelve NIL, las mayúsculas y minúsculas importan
(equal 10 10)  ;; Devuelve T, porque compara números por valor
(equal 10.0 10)  ;; Devuelve NIL, porque no iguala flotantes y enteros
#+END_SRC

- **Mejor uso**: Comparación de listas, cadenas, símbolos, y números.

