index.html

<div id="outline-container-orgc1aa77f" class="outline-4">
<h4 id="orgc1aa77f">Ejemplos</h4>
<div class="outline-text-4" id="text-orgc1aa77f">
</div>
<ul class="org-ul">
<li><a id="orgb817f36"></a>Ejemplo 4: Filtrando listas con `mapcar`<br />
<div class="outline-text-5" id="text-orgb817f36">
<p>
Aunque `mapcar` no está diseñado específicamente para filtrar listas,
podemos usarlo junto con una función condicional para obtener un
efecto de filtrado. Por ejemplo, si queremos obtener solo los números
pares de una lista, podríamos hacer lo siguiente:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span><span style="color: #c099ff;">if</span> <span style="color: #b4f9f8;">(</span>evenp x<span style="color: #b4f9f8;">)</span> x nil<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4 5 6<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="orgdbcdbc2">
(nil 2 nil 4 nil 6)
</pre>

<p>
Esto devolverá `nil` para los números impares y los números pares sin cambios.
</p>
</div>
</li>

<li><a id="orgbad4054"></a>Ejemplo 5: Transformando listas de listas<br />
<div class="outline-text-5" id="text-orgbad4054">
<p>
`mapcar` también es útil para trabajar con listas de listas. Por ejemplo, si queremos sumar los elementos de sublistas:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>lst<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>apply #'+ lst<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span>1 2 3<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>4 5 6<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>7 8 9<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org7f702b1">
(6 15 24)
</pre>

<p>
Aquí, hemos sumado los elementos de cada sublista.
</p>
</div>
</li>

<li><a id="org16ecb34"></a>Ejemplo 6: Trabajando con cadenas de texto<br />
<div class="outline-text-5" id="text-org16ecb34">
<p>
`mapcar` no está limitado solo a números. También puede aplicarse a listas de caracteres o cadenas de texto:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar #'char-upcase '<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"a"</span> <span style="color: #c3e88d;">"b"</span> <span style="color: #c3e88d;">"c"</span> <span style="color: #c3e88d;">"d"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="orga0f8f8b">
("A" "B" "C" "D")
</pre>

<p>
Este ejemplo convierte cada letra en mayúscula.
</p>

<ul class="org-ul">
<li>`mapcar` es una función poderosa en Lisp para aplicar una función a cada elemento de una o más listas.</li>
<li>Puedes usar funciones predefinidas, como `1+` o `+`, o funciones anónimas (lambda).</li>
<li>Se puede aplicar a listas de números, cadenas de texto, o incluso listas de listas.</li>
</ul>


<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Definimos una lista de n&#250;meros</span>
<span style="color: #c099ff;">(</span>setq numeros '<span style="color: #ff995e;">(</span>1 2 3 4 5 6 7 8 9 10<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Usamos mapcar para obtener los n&#250;meros pares multiplicados por 2</span>
<span style="color: #c099ff;">(</span>mapcar <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span><span style="color: #c099ff;">if</span> <span style="color: #b4f9f8;">(</span>evenp x<span style="color: #b4f9f8;">)</span> <span style="color: #b4f9f8;">(</span>* x 2<span style="color: #b4f9f8;">)</span> nil<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> numeros<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Aplicamos mapcar para sumar los elementos de dos listas</span>
<span style="color: #c099ff;">(</span>mapcar #'+ '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>4 5 6<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Aplicamos mapcar para convertir letras min&#250;sculas a may&#250;sculas</span>
<span style="color: #c099ff;">(</span>mapcar #'char-upcase '<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"a"</span> <span style="color: #c3e88d;">"b"</span> <span style="color: #c3e88d;">"c"</span> <span style="color: #c3e88d;">"d"</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org5a4c081" class="outline-3">
<h3 id="org5a4c081">Manual de Comparaciones en Lisp</h3>
<div class="outline-text-3" id="text-org5a4c081">
<p>
En <b><b>Lisp</b></b>, las funciones de comparación se utilizan para comparar
diferentes tipos de objetos: números, cadenas, símbolos, listas,
etc. Dependiendo del tipo de dato que estés comparando, es importante
usar la función adecuada.
</p>
</div>

<div id="outline-container-orgf4fdcc6" class="outline-4">
<h4 id="orgf4fdcc6">1. <b>eq</b></h4>
<div class="outline-text-4" id="text-orgf4fdcc6">
<p>
La función <b>eq</b> es la forma más básica de comparación en Lisp. Compara si dos objetos son <b><b>idénticos</b></b> (el mismo objeto en memoria). Generalmente se usa para comparar símbolos.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>eq 'a 'a<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, porque los s&#237;mbolos son el mismo objeto</span>
<span style="color: #c099ff;">(</span>eq 'a 'b<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, los s&#237;mbolos son diferentes</span>
<span style="color: #c099ff;">(</span>eq 10 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">En algunas implementaciones puede devolver NIL</span>
<span style="color: #c099ff;">(</span>eq <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, las cadenas no son el mismo objeto en memoria</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparación de símbolos.</li>
<li><b><b>Advertencia</b></b>: No usar para comparar números o cadenas de texto, ya que puede devolver resultados inesperados.</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb851ce" class="outline-4">
<h4 id="orgeb851ce">2. <b>eql</b></h4>
<div class="outline-text-4" id="text-orgeb851ce">
<p>
<b>eql</b> es más general que <b>eq</b>. Se comporta igual que <b>eq</b> para símbolos, pero también maneja correctamente la comparación de números y caracteres.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>eql 'a 'a<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T</span>
<span style="color: #c099ff;">(</span>eql 10 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, porque compara n&#250;meros por su valor</span>
<span style="color: #c099ff;">(</span>eql 10.0 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, porque compara tipos tambi&#233;n (entero vs flotante)</span>
<span style="color: #c099ff;">(</span>eql #\A #\A<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, compara caracteres</span>
<span style="color: #c099ff;">(</span>eql <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, porque compara referencias de cadenas</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparación de símbolos, números, y caracteres.</li>
</ul>
</div>
</div>

<div id="outline-container-org07db937" class="outline-4">
<h4 id="org07db937">3. <b>equal</b></h4>
<div class="outline-text-4" id="text-org07db937">
<p>
<b>equal</b> compara el contenido de dos objetos de forma más flexible. Es capaz de comparar listas, números, símbolos, y cadenas de texto, pero no distingue entre mayúsculas y minúsculas en cadenas.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>equal '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, compara listas por contenido</span>
<span style="color: #c099ff;">(</span>equal <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, compara cadenas por su contenido</span>
<span style="color: #c099ff;">(</span>equal <span style="color: #c3e88d;">"Hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, las may&#250;sculas y min&#250;sculas importan</span>
<span style="color: #c099ff;">(</span>equal 10 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, porque compara n&#250;meros por valor</span>
<span style="color: #c099ff;">(</span>equal 10.0 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, porque no iguala flotantes y enteros</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparación de listas, cadenas, símbolos, y números.</li>
</ul>
</div>
</div>
