prolog.org
*** 4. *equalp*
*equalp* es similar a *equal*, pero es más "tolerante". Ignora las diferencias entre mayúsculas y minúsculas en cadenas, y compara enteros y flotantes de manera flexible.

#+BEGIN_SRC lisp
(equalp "hola" "HOLA")  ;; Devuelve T, ignora mayúsculas y minúsculas
(equalp 10 10.0)  ;; Devuelve T, iguala enteros y flotantes
(equalp '(1 2 3) '(1 2 3))  ;; Devuelve T, compara listas por contenido
(equalp #\A #\a)  ;; Devuelve T, ignora las diferencias entre mayúsculas y minúsculas en caracteres
#+END_SRC

- **Mejor uso**: Comparación de listas, números, caracteres y cadenas ignorando las diferencias menores.

*** 5. *=*
*=* se usa exclusivamente para comparar **números**. Compara números enteros y flotantes, asegurándose de que sus valores sean los mismos.

#+BEGIN_SRC lisp
(= 10 10)  ;; Devuelve T, ambos números son iguales
(= 10 10.0)  ;; Devuelve T, porque compara números enteros y flotantes
(= 5 10)  ;; Devuelve NIL, los números son diferentes
(= "10" 10)  ;; Error, no se puede usar para comparar cadenas
#+END_SRC

- **Mejor uso**: Comparación de números.

*** 6. */=*
*/=* compara si dos números **no** son iguales.

#+BEGIN_SRC lisp
(/= 10 5)  ;; Devuelve T, los números son diferentes
(/= 10 10)  ;; Devuelve NIL, los números son iguales
#+END_SRC

- **Mejor uso**: Verificar que dos números no sean iguales.

*** 7. *string=*
*string=* se utiliza para comparar cadenas de texto de manera exacta, respetando las diferencias entre mayúsculas y minúsculas.

#+BEGIN_SRC lisp
(string= "hola" "hola")  ;; Devuelve T, las cadenas son iguales
(string= "Hola" "hola")  ;; Devuelve NIL, mayúsculas y minúsculas no coinciden
#+END_SRC

- **Mejor uso**: Comparar cadenas de texto exactamente, respetando mayúsculas y minúsculas.

*** 8. *string-equal*
*string-equal* es similar a *string=*, pero ignora las diferencias entre mayúsculas y minúsculas.

#+BEGIN_SRC lisp
(string-equal "hola" "HOLA")  ;; Devuelve T, ignora las diferencias de mayúsculas
#+END_SRC

- **Mejor uso**: Comparar cadenas de texto sin importar las mayúsculas y minúsculas.

*** 9. *char=* y *char-equal*
Estas funciones comparan caracteres individuales. *char=* compara caracteres de manera exacta, mientras que *char-equal* ignora las diferencias entre mayúsculas y minúsculas.

#+BEGIN_SRC lisp
(char= #\A #\A)  ;; Devuelve T, los caracteres son iguales
(char= #\A #\a)  ;; Devuelve NIL, mayúsculas y minúsculas no coinciden
(char-equal #\A #\a)  ;; Devuelve T, ignora las diferencias de mayúsculas
#+END_SRC

- **Mejor uso**: Comparar caracteres individuales.

*** Resumen
| Función        | Propósito                               | Caso de uso                                          |
| -------------- | --------------------------------------- | --------------------------------------------------- |
| *eq*           | Comparar si dos símbolos son idénticos  | Comparación de símbolos                             |
| *eql*          | Comparar símbolos, números y caracteres | Comparación de símbolos, números y caracteres       |
| *equal*        | Comparar listas, cadenas y objetos      | Comparación de listas, cadenas y objetos estructurados |
| *equalp*       | Comparar listas y cadenas de forma flexible | Comparación flexible de listas, cadenas, números y caracteres |
| *=*            | Comparar si dos números son iguales     | Comparación estricta de números                     |
| */=*           | Comparar si dos números no son iguales  | Verificar que dos números sean diferentes           |
| *string=*      | Comparar cadenas exactamente            | Comparar cadenas de texto, respetando mayúsculas    |
| *string-equal* | Comparar cadenas, ignorando mayúsculas  | Comparar cadenas de texto, ignorando mayúsculas     |
| *char=*        | Comparar caracteres exactamente         | Comparar caracteres individuales                    |
| *char-equal*   | Comparar caracteres, ignorando mayúsculas | Comparación flexible de caracteres                  |

