index.html

<div id="outline-container-org939cb51" class="outline-4">
<h4 id="org939cb51">4. <b>equalp</b></h4>
<div class="outline-text-4" id="text-org939cb51">
<p>
<b>equalp</b> es similar a <b>equal</b>, pero es más "tolerante". Ignora las diferencias entre mayúsculas y minúsculas en cadenas, y compara enteros y flotantes de manera flexible.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>equalp <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"HOLA"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, ignora may&#250;sculas y min&#250;sculas</span>
<span style="color: #c099ff;">(</span>equalp 10 10.0<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, iguala enteros y flotantes</span>
<span style="color: #c099ff;">(</span>equalp '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, compara listas por contenido</span>
<span style="color: #c099ff;">(</span>equalp #\A #\a<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, ignora las diferencias entre may&#250;sculas y min&#250;sculas en caracteres</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparación de listas, números, caracteres y cadenas ignorando las diferencias menores.</li>
</ul>
</div>
</div>

<div id="outline-container-orga2946d8" class="outline-4">
<h4 id="orga2946d8">5. <b>=</b></h4>
<div class="outline-text-4" id="text-orga2946d8">
<p>
<b>=</b> se usa exclusivamente para comparar <b><b>números</b></b>. Compara números enteros y flotantes, asegurándose de que sus valores sean los mismos.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>= 10 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, ambos n&#250;meros son iguales</span>
<span style="color: #c099ff;">(</span>= 10 10.0<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, porque compara n&#250;meros enteros y flotantes</span>
<span style="color: #c099ff;">(</span>= 5 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, los n&#250;meros son diferentes</span>
<span style="color: #c099ff;">(</span>= <span style="color: #c3e88d;">"10"</span> 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Error, no se puede usar para comparar cadenas</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparación de números.</li>
</ul>
</div>
</div>

<div id="outline-container-org6633be7" class="outline-4">
<h4 id="org6633be7">6. <b>/=</b></h4>
<div class="outline-text-4" id="text-org6633be7">
<p>
<b>/=</b> compara si dos números <b><b>no</b></b> son iguales.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>/= 10 5<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, los n&#250;meros son diferentes</span>
<span style="color: #c099ff;">(</span>/= 10 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, los n&#250;meros son iguales</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Verificar que dos números no sean iguales.</li>
</ul>
</div>
</div>

<div id="outline-container-org2491f99" class="outline-4">
<h4 id="org2491f99">7. <b>string=</b></h4>
<div class="outline-text-4" id="text-org2491f99">
<p>
<b>string=</b> se utiliza para comparar cadenas de texto de manera exacta, respetando las diferencias entre mayúsculas y minúsculas.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>string= <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, las cadenas son iguales</span>
<span style="color: #c099ff;">(</span>string= <span style="color: #c3e88d;">"Hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, may&#250;sculas y min&#250;sculas no coinciden</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparar cadenas de texto exactamente, respetando mayúsculas y minúsculas.</li>
</ul>
</div>
</div>

<div id="outline-container-org76bb757" class="outline-4">
<h4 id="org76bb757">8. <b>string-equal</b></h4>
<div class="outline-text-4" id="text-org76bb757">
<p>
<b>string-equal</b> es similar a <b>string=</b>, pero ignora las diferencias entre mayúsculas y minúsculas.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>string-equal <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"HOLA"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, ignora las diferencias de may&#250;sculas</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparar cadenas de texto sin importar las mayúsculas y minúsculas.</li>
</ul>
</div>
</div>

<div id="outline-container-org8fe663b" class="outline-4">
<h4 id="org8fe663b">9. <b>char=</b> y <b>char-equal</b></h4>
<div class="outline-text-4" id="text-org8fe663b">
<p>
Estas funciones comparan caracteres individuales. <b>char=</b> compara caracteres de manera exacta, mientras que <b>char-equal</b> ignora las diferencias entre mayúsculas y minúsculas.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>char= #\A #\A<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, los caracteres son iguales</span>
<span style="color: #c099ff;">(</span>char= #\A #\a<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve NIL, may&#250;sculas y min&#250;sculas no coinciden</span>
<span style="color: #c099ff;">(</span>char-equal #\A #\a<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Devuelve T, ignora las diferencias de may&#250;sculas</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Mejor uso</b></b>: Comparar caracteres individuales.</li>
</ul>
</div>
</div>

<div id="outline-container-org6217282" class="outline-4">
<h4 id="org6217282">Resumen</h4>
<div class="outline-text-4" id="text-org6217282">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Función</td>
<td class="org-left">Propósito</td>
<td class="org-left">Caso de uso</td>
</tr>

<tr>
<td class="org-left">--------------</td>
<td class="org-left">---------------------------------------</td>
<td class="org-left">---------------------------------------------------</td>
</tr>

<tr>
<td class="org-left"><b>eq</b></td>
<td class="org-left">Comparar si dos símbolos son idénticos</td>
<td class="org-left">Comparación de símbolos</td>
</tr>

<tr>
<td class="org-left"><b>eql</b></td>
<td class="org-left">Comparar símbolos, números y caracteres</td>
<td class="org-left">Comparación de símbolos, números y caracteres</td>
</tr>

<tr>
<td class="org-left"><b>equal</b></td>
<td class="org-left">Comparar listas, cadenas y objetos</td>
<td class="org-left">Comparación de listas, cadenas y objetos estructurados</td>
</tr>

<tr>
<td class="org-left"><b>equalp</b></td>
<td class="org-left">Comparar listas y cadenas de forma flexible</td>
<td class="org-left">Comparación flexible de listas, cadenas, números y caracteres</td>
</tr>

<tr>
<td class="org-left"><b>=</b></td>
<td class="org-left">Comparar si dos números son iguales</td>
<td class="org-left">Comparación estricta de números</td>
</tr>

<tr>
<td class="org-left"><b>/=</b></td>
<td class="org-left">Comparar si dos números no son iguales</td>
<td class="org-left">Verificar que dos números sean diferentes</td>
</tr>

<tr>
<td class="org-left"><b>string=</b></td>
<td class="org-left">Comparar cadenas exactamente</td>
<td class="org-left">Comparar cadenas de texto, respetando mayúsculas</td>
</tr>

<tr>
<td class="org-left"><b>string-equal</b></td>
<td class="org-left">Comparar cadenas, ignorando mayúsculas</td>
<td class="org-left">Comparar cadenas de texto, ignorando mayúsculas</td>
</tr>

<tr>
<td class="org-left"><b>char=</b></td>
<td class="org-left">Comparar caracteres exactamente</td>
<td class="org-left">Comparar caracteres individuales</td>
</tr>

<tr>
<td class="org-left"><b>char-equal</b></td>
<td class="org-left">Comparar caracteres, ignorando mayúsculas</td>
<td class="org-left">Comparación flexible de caracteres</td>
</tr>
</tbody>
</table>
</div>
</div>
