prolog.org
*** Ejemplo completo

#+BEGIN_SRC lisp
;; Comparación de símbolos
(eq 'a 'a)  ;; T
(eq 'a 'b)  ;; NIL

;; Comparación de números y caracteres
(eql 10 10)  ;; T
(eql 10.0 10)  ;; NIL
(eql #\A #\A)  ;; T

;; Comparación de listas y cadenas
(equal '(1 2 3) '(1 2 3))  ;; T
(equal "Hola" "hola")  ;; NIL
(equalp "Hola" "hola")  ;; T

;; Comparación numérica
(= 10 10.0)  ;; T
(/= 10 5)  ;; T

;; Comparación de cadenas
(string= "hola" "HOLA")  ;; NIL
(string-equal "hola" "HOLA")  ;; T

;; Comparación de caracteres
(char= #\A #\A)  ;; T
(char-equal #\A #\a)  ;; T
#+END_SRC


** Funciones lambda en Lisp

*** Introducción
En **Lisp**, las **funciones lambda** son funciones anónimas que
puedes definir sin necesidad de darles un nombre. Son útiles cuando
necesitas una función pequeña y no quieres definirla por
separado. Estas funciones pueden ser pasadas como argumentos a otras
funciones, utilizadas en listas de procesamiento, o empleadas en
lugares donde una función completa sería innecesaria.

*** Definición básica de una función lambda
La sintaxis básica de una función lambda es la siguiente:

#+BEGIN_SRC lisp
(lambda (parametros) cuerpo)
#+END_SRC

- **parametros**: Una lista de parámetros que la función recibirá.
- **cuerpo**: Las expresiones que se evaluarán cuando se invoque la función.

Ejemplo básico:

#+BEGIN_SRC lisp
(lambda (x) (* x 2))
#+END_SRC

Esta es una función lambda que toma un número `x` y devuelve `x` multiplicado por 2.

*** Ejemplos de uso de lambdas

**** Ejemplo 1: Usando lambdas con `mapcar`
Puedes usar una función lambda directamente en llamadas a funciones como `mapcar`, donde necesitas aplicar una operación a cada elemento de una lista. 

#+BEGIN_SRC lisp
(mapcar (lambda (x) (* x 2)) '(1 2 3 4 5))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(2 4 6 8 10)
#+END_EXAMPLE

En este caso, la función lambda toma cada elemento de la lista `(1 2 3 4 5)` y lo multiplica por 2.

**** Ejemplo 2: Usando lambdas con `reduce`
También puedes usar lambdas en combinación con otras funciones de orden superior como `reduce`. Por ejemplo, para sumar todos los elementos de una lista:

#+BEGIN_SRC lisp
(reduce (lambda (x y) (+ x y)) '(1 2 3 4 5))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
15
#+END_EXAMPLE

Aquí, la lambda toma dos elementos, los suma, y luego pasa el resultado para la siguiente suma.

**** Ejemplo 3: Lambdas dentro de una función
Las funciones lambda también pueden ser utilizadas dentro de otras funciones para definir comportamientos específicos:

#+BEGIN_SRC lisp
(defun aplicar-operacion (operacion lista)
  (mapcar operacion lista))

(aplicar-operacion (lambda (x) (* x x)) '(1 2 3 4))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(1 4 9 16)
#+END_EXAMPLE

Aquí, la función `aplicar-operacion` toma una lambda que eleva cada número al cuadrado y la aplica a la lista.

*** Ámbito de las lambdas
Las lambdas pueden acceder a variables que están en su entorno de definición. Esto es conocido como **alcance léxico**.

**** Ejemplo 4: Usando una variable externa en una lambda
#+BEGIN_SRC lisp
(let ((factor 3))
  (mapcar (lambda (x) (* x factor)) '(1 2 3 4 5)))
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
(3 6 9 12 15)
#+END_EXAMPLE

En este caso, la variable `factor` está definida en el entorno léxico donde se declara la lambda, y la lambda puede acceder a ella.

*** Lambdas como valores de retorno
Las funciones lambda también pueden ser retornadas desde otras funciones, lo que permite construir funciones dinámicamente.

