index.html

<div id="outline-container-org47631f6" class="outline-4">
<h4 id="org47631f6">Ejemplo completo</h4>
<div class="outline-text-4" id="text-org47631f6">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Comparaci&#243;n de s&#237;mbolos</span>
<span style="color: #c099ff;">(</span>eq 'a 'a<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>
<span style="color: #c099ff;">(</span>eq 'a 'b<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">NIL</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Comparaci&#243;n de n&#250;meros y caracteres</span>
<span style="color: #c099ff;">(</span>eql 10 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>
<span style="color: #c099ff;">(</span>eql 10.0 10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">NIL</span>
<span style="color: #c099ff;">(</span>eql #\A #\A<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Comparaci&#243;n de listas y cadenas</span>
<span style="color: #c099ff;">(</span>equal '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>
<span style="color: #c099ff;">(</span>equal <span style="color: #c3e88d;">"Hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">NIL</span>
<span style="color: #c099ff;">(</span>equalp <span style="color: #c3e88d;">"Hola"</span> <span style="color: #c3e88d;">"hola"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Comparaci&#243;n num&#233;rica</span>
<span style="color: #c099ff;">(</span>= 10 10.0<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>
<span style="color: #c099ff;">(</span>/= 10 5<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Comparaci&#243;n de cadenas</span>
<span style="color: #c099ff;">(</span>string= <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"HOLA"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">NIL</span>
<span style="color: #c099ff;">(</span>string-equal <span style="color: #c3e88d;">"hola"</span> <span style="color: #c3e88d;">"HOLA"</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Comparaci&#243;n de caracteres</span>
<span style="color: #c099ff;">(</span>char= #\A #\A<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>
<span style="color: #c099ff;">(</span>char-equal #\A #\a<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">T</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org73ed263" class="outline-3">
<h3 id="org73ed263">Funciones lambda en Lisp</h3>
<div class="outline-text-3" id="text-org73ed263">
</div>
<div id="outline-container-org4489ebb" class="outline-4">
<h4 id="org4489ebb">Introducción</h4>
<div class="outline-text-4" id="text-org4489ebb">
<p>
En <b><b>Lisp</b></b>, las <b><b>funciones lambda</b></b> son funciones anónimas que
puedes definir sin necesidad de darles un nombre. Son útiles cuando
necesitas una función pequeña y no quieres definirla por
separado. Estas funciones pueden ser pasadas como argumentos a otras
funciones, utilizadas en listas de procesamiento, o empleadas en
lugares donde una función completa sería innecesaria.
</p>
</div>
</div>

<div id="outline-container-org9624bfb" class="outline-4">
<h4 id="org9624bfb">Definición básica de una función lambda</h4>
<div class="outline-text-4" id="text-org9624bfb">
<p>
La sintaxis básica de una función lambda es la siguiente:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff995e;">(</span>parametros<span style="color: #ff995e;">)</span> cuerpo<span style="color: #c099ff;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>parametros</b></b>: Una lista de parámetros que la función recibirá.</li>
<li><b><b>cuerpo</b></b>: Las expresiones que se evaluarán cuando se invoque la función.</li>
</ul>

<p>
Ejemplo básico:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff995e;">(</span>x<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">(</span>* x 2<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Esta es una función lambda que toma un número `x` y devuelve `x` multiplicado por 2.
</p>
</div>
</div>

<div id="outline-container-org4a1c0a1" class="outline-4">
<h4 id="org4a1c0a1">Ejemplos de uso de lambdas</h4>
<div class="outline-text-4" id="text-org4a1c0a1">
</div>
<ul class="org-ul">
<li><a id="org7072672"></a>Ejemplo 1: Usando lambdas con `mapcar`<br />
<div class="outline-text-5" id="text-org7072672">
<p>
Puedes usar una función lambda directamente en llamadas a funciones como `mapcar`, donde necesitas aplicar una operación a cada elemento de una lista. 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>mapcar <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>* x 2<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="orge1232cf">
(2 4 6 8 10)
</pre>

<p>
En este caso, la función lambda toma cada elemento de la lista `(1 2 3 4 5)` y lo multiplica por 2.
</p>
</div>
</li>

<li><a id="org5fffcad"></a>Ejemplo 2: Usando lambdas con `reduce`<br />
<div class="outline-text-5" id="text-org5fffcad">
<p>
También puedes usar lambdas en combinación con otras funciones de orden superior como `reduce`. Por ejemplo, para sumar todos los elementos de una lista:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span>reduce <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x y<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>+ x y<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org60744c9">
15
</pre>

<p>
Aquí, la lambda toma dos elementos, los suma, y luego pasa el resultado para la siguiente suma.
</p>
</div>
</li>

<li><a id="orgc164260"></a>Ejemplo 3: Lambdas dentro de una función<br />
<div class="outline-text-5" id="text-orgc164260">
<p>
Las funciones lambda también pueden ser utilizadas dentro de otras funciones para definir comportamientos específicos:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">aplicar-operacion</span> <span style="color: #ff995e;">(</span>operacion lista<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>mapcar operacion lista<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">(</span>aplicar-operacion <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>* x x<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="orgf790dac">
(1 4 9 16)
</pre>

<p>
Aquí, la función `aplicar-operacion` toma una lambda que eleva cada número al cuadrado y la aplica a la lista.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org288ecf2" class="outline-4">
<h4 id="org288ecf2">Ámbito de las lambdas</h4>
<div class="outline-text-4" id="text-org288ecf2">
<p>
Las lambdas pueden acceder a variables que están en su entorno de definición. Esto es conocido como <b><b>alcance léxico</b></b>.
</p>
</div>

<ul class="org-ul">
<li><a id="org552a481"></a>Ejemplo 4: Usando una variable externa en una lambda<br />
<div class="outline-text-5" id="text-org552a481">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">let</span> <span style="color: #ff995e;">(</span><span style="color: #ff98a4;">(</span>factor 3<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>mapcar <span style="color: #ff98a4;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #b4f9f8;">(</span>x<span style="color: #b4f9f8;">)</span> <span style="color: #b4f9f8;">(</span>* x factor<span style="color: #b4f9f8;">)</span><span style="color: #ff98a4;">)</span> '<span style="color: #ff98a4;">(</span>1 2 3 4 5<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org6d49d99">
(3 6 9 12 15)
</pre>

<p>
En este caso, la variable `factor` está definida en el entorno léxico donde se declara la lambda, y la lambda puede acceder a ella.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgef45def" class="outline-4">
<h4 id="orgef45def">Lambdas como valores de retorno</h4>
<div class="outline-text-4" id="text-orgef45def">
<p>
Las funciones lambda también pueden ser retornadas desde otras funciones, lo que permite construir funciones dinámicamente.
</p>
</div>

<ul class="org-ul">
