prolog.org
**** Ejemplo 5: Retornar una lambda desde una función
#+BEGIN_SRC lisp
(defun multiplicador (n)
  (lambda (x) (* x n)))

(setq duplicar (multiplicador 2))
(funcall duplicar 10)
#+END_SRC

Resultado:

#+BEGIN_EXAMPLE
20
#+END_EXAMPLE

Aquí, la función `multiplicador` devuelve una lambda que multiplica por `n`. En el ejemplo, `duplicar` es una función que multiplica por 2, y al llamar `funcall` con `duplicar` y `10`, obtenemos `20`.

*** Usos comunes de lambdas
Las funciones lambda son extremadamente útiles en situaciones donde necesitas funciones temporales o pequeñas que no ameritan una definición completa. Algunas aplicaciones comunes son:

- En procesamiento de listas (`mapcar`, `reduce`, etc.).
- Para definir funciones rápidas que solo se usan en una parte del código.
- Para generar funciones dinámicamente, como vimos en el ejemplo de `multiplicador`.

*** Ejemplos

#+BEGIN_SRC lisp
;; Usando lambda con mapcar para elevar números al cubo
(mapcar (lambda (x) (* x x x)) '(1 2 3 4 5))

;; Usando lambda con reduce para multiplicar todos los elementos
(reduce (lambda (x y) (* x y)) '(1 2 3 4 5))

;; Usando lambda dentro de una función personalizada
(defun aplicar-operacion (operacion lista)
  (mapcar operacion lista))

(aplicar-operacion (lambda (x) (+ x 10)) '(1 2 3 4 5))

;; Retornando una lambda desde una función
(defun multiplicador (n)
  (lambda (x) (* x n)))

(setq triplicar (multiplicador 3))
(funcall triplicar 10)
#+END_SRC


