index.html
<li><a id="org130d47a"></a>Ejemplo 5: Retornar una lambda desde una función<br />
<div class="outline-text-5" id="text-org130d47a">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">multiplicador</span> <span style="color: #ff995e;">(</span>n<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>* x n<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">(</span>setq duplicar <span style="color: #ff995e;">(</span>multiplicador 2<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>funcall duplicar 10<span style="color: #c099ff;">)</span>
</pre>
</div>

<p>
Resultado:
</p>

<pre class="example" id="org010d728">
20
</pre>

<p>
Aquí, la función `multiplicador` devuelve una lambda que multiplica por `n`. En el ejemplo, `duplicar` es una función que multiplica por 2, y al llamar `funcall` con `duplicar` y `10`, obtenemos `20`.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orga2524a6" class="outline-4">
<h4 id="orga2524a6">Usos comunes de lambdas</h4>
<div class="outline-text-4" id="text-orga2524a6">
<p>
Las funciones lambda son extremadamente útiles en situaciones donde necesitas funciones temporales o pequeñas que no ameritan una definición completa. Algunas aplicaciones comunes son:
</p>

<ul class="org-ul">
<li>En procesamiento de listas (`mapcar`, `reduce`, etc.).</li>
<li>Para definir funciones rápidas que solo se usan en una parte del código.</li>
<li>Para generar funciones dinámicamente, como vimos en el ejemplo de `multiplicador`.</li>
</ul>
</div>
</div>

<div id="outline-container-org22df448" class="outline-4">
<h4 id="org22df448">Ejemplos</h4>
<div class="outline-text-4" id="text-org22df448">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Usando lambda con mapcar para elevar n&#250;meros al cubo</span>
<span style="color: #c099ff;">(</span>mapcar <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>* x x x<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Usando lambda con reduce para multiplicar todos los elementos</span>
<span style="color: #c099ff;">(</span>reduce <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x y<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>* x y<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Usando lambda dentro de una funci&#243;n personalizada</span>
<span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">aplicar-operacion</span> <span style="color: #ff995e;">(</span>operacion lista<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span>mapcar operacion lista<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">(</span>aplicar-operacion <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>+ x 10<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> '<span style="color: #ff995e;">(</span>1 2 3 4 5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;">;; </span><span style="color: #7a88cf;">Retornando una lambda desde una funci&#243;n</span>
<span style="color: #c099ff;">(</span><span style="color: #c099ff;">defun</span> <span style="color: #82aaff;">multiplicador</span> <span style="color: #ff995e;">(</span>n<span style="color: #ff995e;">)</span>
  <span style="color: #ff995e;">(</span><span style="color: #c099ff;">lambda</span> <span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">(</span>* x n<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">(</span>setq triplicar <span style="color: #ff995e;">(</span>multiplicador 3<span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">(</span>funcall triplicar 10<span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
