index.html


<div id="outline-container-orge2b9ad4" class="outline-2">
<h2 id="orge2b9ad4">Prolog</h2>
<div class="outline-text-2" id="text-orge2b9ad4">
<p>
Una regla sirve para representar conocimiento que en lenguaje natural
 se expresa mediante una sentencia condicional. Por ejemplo, si en
 lenguaje natural decimos «si X es padre de Y entonces Y es hijo de X»
 , en Prolog escribiremos: hijo(Y,X) :- padre(X,Y).  El símbolo «:-»
 significa «si» , y la traducción directa al lenguaje natural de la
 regla es: «Y es hijo de X si X es padre de Y» .  Las reglas resultan
 muy útiles para definir nuevos predicados a partir de otros
 previamente definidos. Por ejemplo, podríamos tener un conjunto de
 hechos de la forma «padre(juan, luis)» , «padre(luis,jaime)» , etc.,
 que definen el predicado (o relación) «padre» por extensión. La regla
 anterior define intensionalmente la relación «hijo» .  Muchas
 expresiones que en lenguaje natural no tienen explícitamente la forma
 condicional pueden representarse de este modo manteniendo su
 significado: «todos los hombres son mortales» es equivalente a decir
 «si X es un hombre entonces X es mortal» ; en Prolog:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #82aaff;">mortal</span><span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span><span style="color: #c099ff;">)</span> :- hombre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span><span style="color: #c099ff;">)</span>.
</pre>
</div>

<p>
En general, una regla tiene una «cabeza» y un «cuerpo» . La cabeza es
un predicado, y el cuerpo una conjunción de literales; para indicar la
conjunción se utiliza una coma separando a los predicados del cuerpo:
una definición de «abuelo» es:
</p>
<div class="org-src-container">
<pre class="src src-prolog"> abuelo<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- padre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Z</span><span style="color: #c099ff;">)</span>,padre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">Z</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span>.
</pre>
</div>

<p>
(X es abuelo de Y si X es padre de algún individuo Z que, a su vez, es
padre de Y).  Pero esta definición estaría incompleta: sólo cubre los
abuelos paternos. Podemos completarla añadiendo otra regla:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #82aaff;">abuelo</span><span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- padre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Z</span><span style="color: #c099ff;">)</span>,madre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">Z</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span>.
</pre>
</div>

<p>
Escribir dos o más reglas para definir un predicado es la manera
normal de expresar en Prolog lo que en lógica sería una disyunción. En
este caso, «X es abuelo de Y si&#x2026; o bien si&#x2026;» . También puede
expresarse explícitamente la disyunción mediante «;» :
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #82aaff;">abuelo</span><span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- padre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Z</span><span style="color: #c099ff;">)</span>,<span style="color: #c099ff;">(</span>padre<span style="color: #ff995e;">(</span><span style="color: #ff98a4;">Z</span>,<span style="color: #ff98a4;">Y</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">;</span>madre<span style="color: #ff995e;">(</span><span style="color: #ff98a4;">Z</span>,<span style="color: #ff98a4;">Y</span><span style="color: #ff995e;">)</span><span style="color: #c099ff;">)</span>.
</pre>
</div>

<p>
pero normalmente se prefiere la versión en dos reglas por su mayor
claridad.  También se puede definir introduciendo un concepto
intermedio, «progenitor» (padre o madre):
</p>

<div class="org-src-container">
<pre class="src src-prolog"> progenitor<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- padre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span>.  
 progenitor<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- madre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span>.  
 abuelo<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- padre<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Z</span><span style="color: #c099ff;">)</span>,progenitor<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">Z</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span>.
</pre>
</div>

<p>
El cuerpo de la regla puede contener literales negativos. Por ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #82aaff;">hermano</span><span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- progenitor<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">Z</span>,<span style="color: #ff98a4;">X</span><span style="color: #c099ff;">)</span>,  
                 progenitor<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">Z</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span>, not <span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>=<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span>.
</pre>
</div>


<p>
importante: no debe confundirse «reglas de inferencia» con «reglas»
(de Prolog) (y tampoco con «reglas gramaticales»). Las «reglas» de
Prolog son sentencias condicionales que se satisfacen para unas
interpretaciones pero no para otras. Una regla de inferencia es un
esquema general de razonamiento que, formalizado, se representa por
una sentencia válida (Apartado . Por ejemplo, la regla de Prolog
«men(x) :- pol(x)» corresponde a la sentencia condicional ( A
x)(pol(x) ==&gt;men(x)) se satisface para unas interpretaciones pero no
para otras. Una particularización de la regla de inferencia modus
ponens es: P1: ( A x)(pol(x) ==&gt;men(x)) P2: pol(x) C: men(x) a la que
corresponde la sentencia ( A x)((pol(x) ==&gt;men(x)) /\ pol(x)
==&gt;men(x)), que es una sentencia válida (se satisface con cualquier
interpretación de los predicados y cualquier asignación de x).
</p>
</div>
