index.html

<div id="outline-container-orge7d30bc" class="outline-3">
<h3 id="orge7d30bc">Corte</h3>
<div class="outline-text-3" id="text-orge7d30bc">
<p>
El corte es un predicado predefinido que no recibe argumentos. Se
representa mediante un signo de admiración (!). Sin duda, es el
predicado más difícil de entender. El corte tiene la espantosa
propiedad de eliminar los puntos de elección del predicado que lo
contiene.
</p>

<p>
Es decir, cuando se ejecuta el corte, el resultado del objetivo (no
sólo la cláusula en cuestión) queda comprometido al éxito o fallo de
los objetivos que aparecen a continuación. Es como si a Prolog "se le
olvidase" que dicho objetivo puede tener varias soluciones.
</p>

<p>
Otra forma de ver el efecto del corte es pensar que solamente tiene la
propiedad de detener el backtracking cuando éste se produce. Es decir,
en la ejecución normal el corte no hace nada. Pero cuando el programa
entra en backtracking y los objetivos se recorren marcha atrás, al
llegar al corte el backtracking se detiene repentinamente forzando el
fallo del objetivo.
</p>



<p>
Para entender de manera simple el uso del corte vamos a comparar dos
predicados que solamente se diferencian en un corte:
</p>


<div class="org-src-container">
<pre class="src src-prolog"> <span style="color: #7a88cf;">% </span><span style="color: #7a88cf;">Sin corte. </span>
 p<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- <span style="color: #ff98a4;">X</span> &gt; 15, <span style="color: #ff98a4;">Y</span> &gt; 50. 
 
 p<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- <span style="color: #ff98a4;">X</span> &gt; <span style="color: #ff98a4;">Y</span>, 

 <span style="color: #7a88cf;">% </span><span style="color: #7a88cf;">Con corte.</span>
 q<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- <span style="color: #ff98a4;">X</span> &gt; 15, <span style="color: #c099ff;">!</span>, <span style="color: #ff98a4;">Y</span> &gt; 50. 
 
 q<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">X</span>,<span style="color: #ff98a4;">Y</span><span style="color: #c099ff;">)</span> :- <span style="color: #ff98a4;">X</span> &gt; <span style="color: #ff98a4;">Y</span>, 

</pre>
</div>


<p>
Veamos que ocurre si ejecutamos el objetivo p(25,12):
</p>

<ul class="org-ul">
<li>Obsérve que ambas cláusulas unifican con la cabeza, luego existen
dos puntos de elección que se anotan.</li>
<li>Prolog entra por el primer punto de elección (primera cláusula)
eliminandolo.</li>
<li>Prolog ejecuta el primer objetivo del cuerpo (X&gt;15), que tiene
éxito.</li>
<li>Prolog ejecuta el segundo objetivo del cuerpo (X&gt;50), que falla.</li>
<li>Empieza el backtracking.</li>
<li>Se recorren ambos objetivos hacia atrás pero no hay variables que se
hayan ligado en ellos.</li>
<li>Encontramos el segundo punto de elección (segunda cláusula) que
detiene el backtracking eliminandolo en el proceso. La ejecución
continúa hacia delante.</li>
<li>Prolog ejecuta el cuerpo de la segunda cláusula que consiste en
X&gt;Y. Este objetivo tiene éxito.</li>
<li>El objetivo p(25,12) tiene éxito.</li>
</ul>

<p>
Ahora comprobamos lo que ocurre cuando éxiste el corte, ejecutamos q(25,12):
</p>

<ul class="org-ul">
<li>Ambas cláusulas unifican con la cabeza, luego existen dos puntos de
elección que se anotan.</li>
<li>Prolog entra por el primer punto de elección (primera cláusula)
eliminandolo.</li>
<li>Prolog ejecuta el primer objetivo del cuerpo (X&gt;15), que tiene
éxito.</li>
<li>Se ejecuta el segundo objetivo del cuerpo que es el corte. Por
tanto, se eliminan todos los puntos de elección anotados que son
debidos al objetivo q(25,12). Solamente teníamos uno, que se
elimina.</li>
<li>Prolog ejecuta el tercer objetivo del cuerpo (X&gt;50), que falla.</li>
<li>Empieza el backtracking.</li>
<li>Se recorren ambos objetivos hacia atrás pero no hay variables que se
hayan ligado en ellos.</li>
<li>No encontramos ningún punto de elección porque fueron eliminados por
el corte.</li>
<li>El objetivo p(25,12) falla.</li>
</ul>

<p>
Como puede comprobar, los resultados son sustacialmente diferentes. La
segunda cláusula del predicado q/2 ni siquiera ha llegado a ejecutarse
porque el corte ha comprometido el resultado del objetivo al resultado
de Y&gt;15 en la primera cláusula.
</p>
</div>
</div>


<div id="outline-container-orgaee389b" class="outline-3">
<h3 id="orgaee389b">Usos del corte</h3>
<div class="outline-text-3" id="text-orgaee389b">
<p>
El corte se utiliza muy frecuentemente, cuanto más diestro es el
programador más lo suele usar. Los motivos por los que se usa el corte
son, por orden de importancia, los siguientes:
</p>

<ul class="org-ul">
<li>Para optimizar la ejecución. El corte sirve para evitar que por
culpa del backtracking se exploren puntos de elección que, con toda
seguridad, no llevan a otra solución (fallan). Para los entendidos,
esto es podar el árbol de búsqueda de posibles soluciones.</li>
<li>Para facilitar la legibilidad y comprensión del algoritmo que está
siendo programado. A veces se situan cortes en puntos donde, con
toda seguridad, no van a existir puntos de elección para eliminar,
pero ayuda a entender que la ejecución sólo depende de la cláusula
en cuestión.</li>
<li>Para implementar algoritmos diferentes según la combinación de
argumentos de entrada. Algo similar al comportamiento de las
sentencias case en los lenguajes imperativos.</li>
<li>Para conseguir que un predicado solamente tenga una solución. Esto
nos puede interesar en algún momento. Una vez que el programa
encuentra una solución ejecutamos un corte. Así evitamos que Prolog
busque otras soluciones aunque sabemos que éstas existen.</li>
</ul>
</div>
</div>

<div id="outline-container-org09de58b" class="outline-3">
<h3 id="org09de58b">Corte y fallo</h3>
<div class="outline-text-3" id="text-org09de58b">
<p>
Es muy habitual encontrar la secuencia de objetivos corte-fallo:
!,fail. El predicado fail/0 es un predicado predefinido que siempre
falla. Se utiliza para detectar prematuramente combinaciones de los
argumentos que no llevan a solución, evitando la ejecución de un
montón de código que al final va a fallar de todas formas.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #82aaff;">fib</span><span style="color: #c099ff;">(</span>0, 1<span style="color: #c099ff;">)</span> :- <span style="color: #c099ff;">!</span>.
<span style="color: #82aaff;">fib</span><span style="color: #c099ff;">(</span>1, 1<span style="color: #c099ff;">)</span> :- <span style="color: #c099ff;">!</span>.
<span style="color: #82aaff;">fib</span><span style="color: #c099ff;">(</span><span style="color: #ff98a4;">N</span>, <span style="color: #ff98a4;">F</span><span style="color: #c099ff;">)</span> :-
        <span style="color: #ff98a4;">N</span> &gt; 1,
        <span style="color: #ff98a4;">N1</span> is <span style="color: #ff98a4;">N</span>-1,
        <span style="color: #ff98a4;">N2</span> is <span style="color: #ff98a4;">N</span>-2,
        fib<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">N1</span>, <span style="color: #ff98a4;">F1</span><span style="color: #c099ff;">)</span>,
        fib<span style="color: #c099ff;">(</span><span style="color: #ff98a4;">N2</span>, <span style="color: #ff98a4;">F2</span><span style="color: #c099ff;">)</span>,
        <span style="color: #ff98a4;">F</span> is <span style="color: #ff98a4;">F1</span>+<span style="color: #ff98a4;">F2</span>.
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
La salida del libro es tacataca
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Eduardo Alcaraz</p>
<p class="date">Created: 2024-10-10 jue 09:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
